[
  {
    "definitions": [
      {
        "word": "a dime a dozen",
        "partOfSpeech": "idiom",
        "enDefinition": "very common and easy to find; not rare or special",
        "ptDefinition": "muito comum; fácil de encontrar; sem nada de especial",
        "examples": [
          {
            "enExample": "Good ideas are a dime a dozen, but great execution is rare.",
            "ptExample": "Boas ideias são muito comuns, mas uma boa execução é rara."
          },
          {
            "enExample": "Cheap smartphones are a dime a dozen these days.",
            "ptExample": "Celulares baratos são muito comuns hoje em dia."
          }
        ],
        "synonyms": ["very common", "ten a penny", "commonplace"],
        "antonyms": ["rare", "hard to find", "unique"],
        "seeAlso": ["nothing special", "run-of-the-mill", "common as dirt"],
        "notes": [
          {
            "enNote": "Originally refers to something so cheap and common that it costs only a dime for a dozen. Widely used in American English.",
            "ptNote": "Originalmente refere-se a algo tão barato e comum que custa apenas uma moeda (dime) por uma dúzia. Muito usada no inglês americano."
          }
        ]
      },
      {
        "word": "dawdle",
        "phonetics": "/ˈdɔːdl/",
        "partOfSpeech": "verb",
        "enDefinition": "to waste time or move slowly and without purpose",
        "ptDefinition": "perder tempo ou mover-se lentamente e sem propósito; demorar-se",
        "examples": [
          {
            "enExample": "Stop dawdling and get ready for school!",
            "ptExample": "Pare de enrolar e se prepare para a escola!"
          },
          {
            "enExample": "He dawdled over his breakfast, making himself late for work.",
            "ptExample": "Ele demorou-se no café da manhã, fazendo-se atrasar para o trabalho."
          }
        ],
        "synonyms": ["loiter", "linger", "dally", "procrastinate"],
        "antonyms": ["hurry", "rush", "hasten"],
        "seeAlso": ["delay", "waste time", "lag"],
        "notes": [
          {
            "enNote": "Often used in situations where someone is taking longer than necessary to complete a task",
            "ptNote": "Frequentemente usado em situações onde alguém está demorando mais que o necessário para completar uma tarefa"
          }
        ]
      },
      {
        "word": "dead-end job",
        "partOfSpeech": "idiom / noun",
        "enDefinition": "a job that offers little or no chance of progress, advancement, or personal growth",
        "ptDefinition": "um emprego que oferece pouca ou nenhuma chance de progresso, promoção ou crescimento pessoal",
        "examples": [
          {
            "enExample": "He quit his dead-end job at the factory to start his own business.",
            "ptExample": "Ele deixou seu emprego sem futuro na fábrica para abrir o próprio negócio."
          },
          {
            "enExample": "Many people feel stuck in dead-end jobs with no opportunities for advancement.",
            "ptExample": "Muitas pessoas se sentem presas em empregos sem futuro e sem oportunidades de crescimento."
          },
          {
            "enExample": "She wanted to do something meaningful instead of staying in a dead-end job.",
            "ptExample": "Ela queria fazer algo significativo em vez de continuar em um emprego sem perspectivas."
          }
        ],
        "synonyms": [
          "unpromising job",
          "stagnant job",
          "low-prospect position"
        ],
        "antonyms": ["career opportunity", "promising job", "growth position"],
        "seeAlso": ["go nowhere job", "career ladder", "promotion"],
        "notes": [
          {
            "enNote": "Often used to describe jobs with no promotion path, skill development, or motivation.",
            "ptNote": "Usado frequentemente para descrever empregos sem possibilidade de promoção, desenvolvimento de habilidades ou motivação."
          },
          {
            "enNote": "Can express frustration or lack of fulfillment in one’s career.",
            "ptNote": "Pode expressar frustração ou falta de realização na carreira."
          }
        ]
      },
      {
        "word": "diamond",
        "phonetics": "/ˈdaɪəmənd/",
        "partOfSpeech": "noun",
        "enDefinition": "a precious stone consisting of a clear and colorless crystalline form of pure carbon, the hardest naturally occurring substance; also, a shape with four straight sides of equal length and two opposite acute angles and two opposite obtuse angles.",
        "ptDefinition": "uma pedra preciosa composta por uma forma cristalina clara e incolor de carbono puro, a substância natural mais dura; também, uma forma com quatro lados retos de igual comprimento e dois ângulos agudos opostos e dois ângulos obtusos opostos.",
        "examples": [
          {
            "enExample": "She wore a beautiful diamond ring on her finger.",
            "ptExample": "Ela usava um lindo anel de diamante no dedo."
          },
          {
            "enExample": "The baseball field is shaped like a diamond.",
            "ptExample": "O campo de beisebol tem formato de losango."
          }
        ],
        "synonyms": ["gem", "jewel", "stone", "lozenge (shape)"],
        "antonyms": [],
        "seeAlso": ["gemstone", "crystal", "lozenge"],
        "notes": [
          {
            "enNote": "Diamonds are valued for their brilliance and hardness, often used in jewelry and industrial cutting tools.",
            "ptNote": "Diamantes são valorizados por seu brilho e dureza, frequentemente usados em joias e ferramentas de corte industriais."
          }
        ]
      },
      {
        "word": "detective",
        "phonetics": "/dɪˈtɛktɪv/",
        "partOfSpeech": "noun",
        "enDefinition": "a person, especially a police officer, whose job is to investigate crimes and find out who committed them",
        "ptDefinition": "pessoa, especialmente policial, cuja função é investigar crimes e descobrir quem os cometeu; detetive",
        "examples": [
          {
            "enExample": "The detective questioned all the witnesses at the crime scene.",
            "ptExample": "O detetive interrogou todas as testemunhas na cena do crime."
          },
          {
            "enExample": "She hired a private detective to find her missing brother.",
            "ptExample": "Ela contratou um detetive particular para encontrar seu irmão desaparecido."
          }
        ],
        "synonyms": ["investigator", "sleuth", "private eye", "gumshoe"],
        "antonyms": ["suspect", "criminal"],
        "seeAlso": ["investigation", "police", "private investigator"],
        "notes": [
          {
            "enNote": "Detectives can work for the police or be privately hired. In fiction, detectives are often portrayed as clever and resourceful.",
            "ptNote": "Detetives podem trabalhar para a polícia ou serem contratados de forma particular. Em obras de ficção, detetives costumam ser retratados como inteligentes e engenhosos."
          }
        ]
      },
      {
        "word": "door",
        "phonetics": "/dɔːr/",
        "partOfSpeech": "noun",
        "enDefinition": "a movable barrier used to close off an entrance, typically to a room, building, or vehicle",
        "ptDefinition": "uma barreira móvel usada para fechar uma entrada, geralmente de um cômodo, edifício ou veículo",
        "examples": [
          {
            "enExample": "She knocked on the door before entering the office.",
            "ptExample": "Ela bateu na porta antes de entrar no escritório."
          },
          {
            "enExample": "Please close the door when you leave.",
            "ptExample": "Por favor, feche a porta ao sair."
          }
        ],
        "synonyms": ["entrance", "gateway", "portal"],
        "antonyms": ["wall", "barrier"],
        "seeAlso": ["window", "gate", "doorway"],
        "notes": [
          {
            "enNote": "Doors can be made of wood, metal, glass, or other materials and may be used for privacy, security, or decoration.",
            "ptNote": "Portas podem ser feitas de madeira, metal, vidro ou outros materiais e podem ser usadas para privacidade, segurança ou decoração."
          }
        ]
      },
      {
        "word": "drive a bargain",
        "partOfSpeech": "idiom",
        "enDefinition": "to negotiate skillfully and firmly to get the best possible deal",
        "ptDefinition": "negociar com habilidade e firmeza para conseguir o melhor acordo possível",
        "examples": [
          {
            "enExample": "She really knows how to drive a bargain when shopping for clothes.",
            "ptExample": "Ela realmente sabe negociar quando compra roupas."
          },
          {
            "enExample": "The car dealer drove a hard bargain, but he finally gave us a discount.",
            "ptExample": "O vendedor de carros negociou duro, mas finalmente nos deu um desconto."
          }
        ],
        "synonyms": ["negotiate", "haggle", "bargain"],
        "antonyms": ["give in", "yield easily"],
        "seeAlso": ["hard bargain", "strike a deal"],
        "notes": [
          {
            "enNote": "Often used in business or everyday shopping contexts, highlighting strong negotiation skills.",
            "ptNote": "Frequentemente usado em contextos de negócios ou compras do dia a dia, destacando boas habilidades de negociação."
          }
        ]
      },
      {
        "word": "deer",
        "phonetics": "/dɪr/",
        "partOfSpeech": "noun",
        "enDefinition": "a graceful, hoofed, grazing animal with antlers, commonly found in forests and grasslands",
        "ptDefinition": "animal herbívoro de casco, geralmente encontrado em florestas e campos, conhecido por seus chifres (galhadas)",
        "examples": [
          {
            "enExample": "A deer crossed the road in front of our car.",
            "ptExample": "Um cervo atravessou a estrada na frente do nosso carro."
          },
          {
            "enExample": "Male deer are called stags or bucks and usually have antlers.",
            "ptExample": "Os cervos machos são chamados de veados e geralmente têm galhadas."
          }
        ],
        "synonyms": ["stag", "buck", "doe (female)", "fawn (young)"],
        "antonyms": [],
        "seeAlso": ["elk", "moose", "antelope"],
        "notes": [
          {
            "enNote": "The word 'deer' is both singular and plural (one deer, many deer).",
            "ptNote": "A palavra 'deer' é usada tanto no singular quanto no plural em inglês."
          }
        ]
      },
      {
        "word": "deal",
        "phonetics": "/diːl/",
        "partOfSpeech": "noun / verb",
        "enDefinition": "as a noun: an agreement or arrangement, especially in business or negotiation. As a verb: to distribute or manage",
        "ptDefinition": "como substantivo: um acordo ou arranjo, especialmente em negócios ou negociações. Como verbo: distribuir ou administrar",
        "examples": [
          {
            "enExample": "They closed a deal to sell the company.",
            "ptExample": "Eles fecharam um acordo para vender a empresa."
          },
          {
            "enExample": "He deals cards at the poker table.",
            "ptExample": "Ele distribui as cartas na mesa de pôquer."
          }
        ],
        "synonyms": ["agreement, contract, transaction, distribute, manage"],
        "antonyms": ["disagreement, refusal, withhold"],
        "seeAlso": ["bargain, negotiate, trade"],
        "notes": [
          {
            "enNote": "Commonly used both as a noun and a verb with different meanings.",
            "ptNote": "Comumente usado como substantivo e verbo com significados diferentes."
          }
        ]
      },
      {
        "word": "deviate",
        "phonetics": "/ˈdiː.vi.eɪt/",
        "partOfSpeech": "verb",
        "enDefinition": "to do something that is different from what is expected or usual",
        "ptDefinition": "fazer algo diferente do que é esperado ou usual",
        "examples": [
          {
            "enExample": "He never deviates from his strict routine.",
            "ptExample": "Ele nunca se desvia de sua rotina rígida."
          },
          {
            "enExample": "The plane had to deviate from its original course due to bad weather.",
            "ptExample": "O avião teve que se desviar da rota original por causa do mau tempo."
          }
        ],
        "synonyms": ["depart", "diverge", "veer", "stray"],
        "antonyms": ["follow", "conform", "adhere", "stay"],
        "seeAlso": ["diverge", "detour", "digress"],
        "notes": [
          {
            "enNote": "Often used in formal or technical contexts.",
            "ptNote": "Frequentemente usado em contextos formais ou técnicos."
          }
        ]
      },
      {
        "word": "different animal",
        "phonetics": "/ˈdɪf.ɚ.ənt ˈæn.ə.məl/",
        "partOfSpeech": "idiom",
        "enDefinition": "something that is very different in nature or character from what was previously considered or compared",
        "ptDefinition": "algo que é muito diferente em natureza ou característica do que foi anteriormente considerado ou comparado",
        "examples": [
          {
            "enExample": "Managing a small team is one thing, but leading an entire department is a different animal.",
            "ptExample": "Gerenciar uma pequena equipe é uma coisa, mas liderar um departamento inteiro é outra história completamente diferente."
          },
          {
            "enExample": "Teaching kids is a different animal compared to teaching adults.",
            "ptExample": "Ensinar crianças é algo bem diferente de ensinar adultos."
          }
        ],
        "synonyms": [
          "another matter",
          "a whole other thing",
          "something entirely different"
        ],
        "antonyms": ["more of the same", "similar case"],
        "seeAlso": ["whole different ballgame", "another story"],
        "notes": [
          {
            "enNote": "Used informally to highlight a significant difference between two situations or things.",
            "ptNote": "Usado informalmente para destacar uma grande diferença entre duas situações ou coisas."
          }
        ]
      },
      {
        "word": "draw",
        "phonetics": "/drɔː/",
        "partOfSpeech": "irregular verb (past: drew / participle: drawn)",
        "enDefinition": "to produce a picture by making lines with a pen, pencil, etc.; to pull or move something in a particular direction",
        "ptDefinition": "produzir um desenho com lápis, caneta etc.; puxar ou mover algo em uma direção específica",
        "examples": [
          {
            "enExample": "She loves to draw landscapes in her notebook.",
            "ptExample": "Ela adora desenhar paisagens no caderno."
          },
          {
            "enExample": "He drew the curtains to block the sunlight.",
            "ptExample": "Ele puxou as cortinas para bloquear a luz do sol."
          }
        ],
        "synonyms": ["sketch", "pull", "attract"],
        "antonyms": ["erase", "push", "repel"],
        "seeAlso": ["drawing", "draw a conclusion", "draw a blank"],
        "notes": [
          {
            "enNote": "‘Draw’ has many meanings, so always consider the context.",
            "ptNote": "‘Draw’ tem muitos significados, por isso é importante considerar o contexto."
          }
        ]
      },
      {
        "word": "draw a blank",
        "partOfSpeech": "idiom",
        "enDefinition": "to fail to get an answer or result; to be unable to remember something",
        "ptDefinition": "não conseguir lembrar ou obter uma resposta ou resultado",
        "examples": [
          {
            "enExample": "I tried to remember his name, but I completely drew a blank.",
            "ptExample": "Tentei lembrar o nome dele, mas deu um branco total."
          },
          {
            "enExample": "The police drew a blank in their search for the suspect.",
            "ptExample": "A polícia não conseguiu nenhum resultado na busca pelo suspeito."
          }
        ],
        "synonyms": ["go blank", "forget", "come up empty"],
        "antonyms": ["remember", "recall", "retrieve"],
        "seeAlso": ["go blank", "slip one’s mind"],
        "notes": [
          {
            "enNote": "Often used when someone forgets something momentarily.",
            "ptNote": "Frequentemente usada quando alguém esquece algo momentaneamente."
          }
        ]
      },
      {
        "word": "down the road",
        "partOfSpeech": "idiom",
        "enDefinition": "at some point in the future",
        "ptDefinition": "em algum momento no futuro",
        "examples": [
          {
            "enExample": "We might move to a bigger house down the road.",
            "ptExample": "Podemos nos mudar para uma casa maior no futuro."
          },
          {
            "enExample": "Down the road, technology will continue to improve.",
            "ptExample": "No futuro, a tecnologia continuará a melhorar."
          }
        ],
        "synonyms": ["in the future", "later on", "eventually"],
        "antonyms": ["now", "immediately"],
        "seeAlso": ["in the long run", "some day"],
        "notes": [
          {
            "enNote": "Often used in informal conversation to talk about future events.",
            "ptNote": "Frequentemente usada em conversas informais para falar sobre eventos futuros."
          }
        ]
      },
      {
        "word": "do a 180",
        "partOfSpeech": "idiom",
        "enDefinition": "to completely change one's opinion, behavior, or position",
        "ptDefinition": "mudar completamente de opinião, comportamento ou posição",
        "examples": [
          {
            "enExample": "He did a 180 on the issue after learning more about it.",
            "ptExample": "Ele mudou completamente de opinião sobre o assunto depois de saber mais sobre ele."
          },
          {
            "enExample": "They did a 180 and decided to support the proposal.",
            "ptExample": "Eles mudaram totalmente de posição e decidiram apoiar a proposta."
          }
        ],
        "synonyms": ["change one's mind", "reverse course", "backtrack"],
        "antonyms": ["stay the course", "stand firm", "be consistent"],
        "seeAlso": "flip-flop",
        "notes": [
          {
            "enNote": "The phrase comes from making a 180-degree turn, meaning a complete reversal.",
            "ptNote": "A expressão vem de uma curva de 180 graus, ou seja, uma reversão completa."
          }
        ]
      },
      {
        "word": "no can do",
        "partOfSpeech": "idiom",
        "enDefinition": "used to say that something is not possible or that you are unwilling or unable to do it",
        "ptDefinition": "usado para dizer que algo não é possível ou que você não está disposto ou não pode fazer",
        "examples": [
          {
            "enExample": "Sorry, no can do — I’m already booked tonight.",
            "ptExample": "Desculpe, não dá — já tenho compromisso esta noite."
          },
          {
            "enExample": "They asked me to work overtime, but I said no can do.",
            "ptExample": "Eles pediram para eu fazer hora extra, mas eu disse que não dava."
          }
        ],
        "synonyms": ["can't do it", "not possible", "no way"],
        "antonyms": ["sure thing", "of course", "can do"],
        "seeAlso": ["can't make it", "no way"],
        "notes": [
          {
            "enNote": "Informal expression that mimics broken English; often used humorously.",
            "ptNote": "Expressão informal que imita inglês com erro proposital; usada com tom de humor ou descontração."
          }
        ]
      },
      {
        "word": "dog-eat-dog world",
        "partOfSpeech": "idiom",
        "enDefinition": "a ruthless environment or situation where people compete aggressively and are willing to harm each other to succeed",
        "ptDefinition": "um ambiente ou situação implacável onde as pessoas competem agressivamente e estão dispostas a prejudicar umas às outras para vencer",
        "examples": [
          {
            "enExample": "The business world is a dog-eat-dog world where only the strongest survive.",
            "ptExample": "O mundo dos negócios é um ambiente implacável onde só os mais fortes sobrevivem."
          },
          {
            "enExample": "In a dog-eat-dog world, you have to watch your back at all times.",
            "ptExample": "Em um mundo cruel e competitivo, você precisa estar sempre atento."
          }
        ],
        "synonyms": ["cutthroat, ruthless, competitive"],
        "antonyms": ["cooperative, friendly, supportive"],
        "seeAlso": "survival of the fittest, ruthless competition",
        "notes": [
          {
            "enNote": "Often used to describe harsh competitive environments.",
            "ptNote": "Frequentemente usada para descrever ambientes competitivos e agressivos."
          }
        ]
      },
      {
        "word": "on the dot",
        "partOfSpeech": "idiom",
        "enDefinition": "exactly at the stated time; precisely on time",
        "ptDefinition": "exatamente na hora marcada; pontualmente",
        "examples": [
          {
            "enExample": "The meeting will start at 10 a.m. on the dot.",
            "ptExample": "A reunião começará às 10 horas em ponto."
          },
          {
            "enExample": "She arrived at the party on the dot, not a minute late.",
            "ptExample": "Ela chegou à festa em ponto, nem um minuto atrasada."
          }
        ],
        "synonyms": ["punctually", "precisely", "exactly"],
        "antonyms": ["late", "early", "delayed"],
        "seeAlso": ["sharp", "right on time", "to the minute"],
        "notes": [
          {
            "enNote": "Commonly used to emphasize punctuality or exact timing.",
            "ptNote": "Comumente usado para enfatizar pontualidade ou exatidão no horário."
          }
        ]
      },
      {
        "word": "don’t waste your breath",
        "partOfSpeech": "idiom",
        "enDefinition": "used to tell someone not to bother trying to persuade or explain something to someone else because it will have no effect",
        "ptDefinition": "usado para dizer a alguém que não adianta tentar convencer ou explicar algo para outra pessoa porque não terá efeito",
        "examples": [
          {
            "enExample": "Don’t waste your breath trying to change his mind—he never listens.",
            "ptExample": "Não perca seu tempo tentando convencê-lo — ele nunca escuta."
          },
          {
            "enExample": "She told me not to waste my breath arguing with the manager.",
            "ptExample": "Ela me disse para não perder tempo discutindo com o gerente."
          }
        ],
        "synonyms": ["don’t bother", "save your breath", "it’s pointless"],
        "antonyms": ["be persuasive", "convince", "succeed"],
        "seeAlso": ["fall on deaf ears", "talk to a brick wall"],
        "notes": [
          {
            "enNote": "This idiom is often used when someone feels their efforts to communicate will be ignored.",
            "ptNote": "Este idiom é frequentemente usado quando alguém sente que seus esforços de comunicação serão ignorados."
          }
        ]
      },
      {
        "word": "dump someone",
        "phonetics": "/dʌmp ˈsʌmwʌn/",
        "partOfSpeech": "phrasal verb",
        "enDefinition": "to suddenly end a romantic relationship with someone",
        "ptDefinition": "terminar abruptamente um relacionamento amoroso com alguém",
        "examples": [
          {
            "enExample": "She dumped him after finding out he lied to her.",
            "ptExample": "Ela terminou com ele depois de descobrir que ele mentiu para ela."
          },
          {
            "enExample": "He felt terrible when his girlfriend dumped him by text message.",
            "ptExample": "Ele se sentiu péssimo quando sua namorada terminou com ele por mensagem."
          }
        ],
        "synonyms": ["break up with", "leave", "end a relationship"],
        "antonyms": ["get together", "stay with", "reconcile"],
        "seeAlso": ["break up", "split up"],
        "notes": [
          {
            "enNote": "This phrase is informal and often used when the breakup is sudden or one-sided.",
            "ptNote": "Esta expressão é informal e geralmente usada quando o término é repentino ou unilateral."
          }
        ]
      },
      {
        "word": "dire",
        "phonetics": "/daɪər/",
        "partOfSpeech": "adjective",
        "enDefinition": "extremely serious or urgent; causing great fear or suffering",
        "ptDefinition": "terrível, grave, urgente; que causa muito medo ou sofrimento",
        "examples": [
          {
            "enExample": "The country is in dire need of medical supplies.",
            "ptExample": "O país está em necessidade urgente de suprimentos médicos."
          },
          {
            "enExample": "The economic situation has become dire.",
            "ptExample": "A situação econômica tornou-se grave."
          }
        ],
        "synonyms": ["desperate", "critical", "severe", "extreme"],
        "antonyms": ["mild", "trivial", "insignificant"],
        "seeAlso": ["serious", "urgent"],
        "notes": [
          {
            "enNote": "Often used to emphasize the extreme seriousness of a situation",
            "ptNote": "Frequentemente usado para enfatizar a extrema gravidade de uma situação"
          }
        ]
      },
      {
        "word": "Dream on!",
        "phonetics": "",
        "partOfSpeech": "idiom",
        "enDefinition": "used to tell someone that what they are hoping for is not likely to happen",
        "ptDefinition": "usado para dizer a alguém que o que eles estão esperando não é provável que aconteça",
        "examples": [
          {
            "enExample": "You think you can get a promotion without working hard? Dream on!",
            "ptExample": "Você acha que pode conseguir uma promoção sem trabalhar duro? Continue sonhando!"
          },
          {
            "enExample": "He thinks he can win the lottery. Dream on!",
            "ptExample": "Ele acha que pode ganhar na loteria. Continue sonhando!"
          }
        ],
        "synonyms": ["keep dreaming", "in your dreams"],
        "antonyms": ["realistic", "practical"],
        "seeAlso": ["wishful thinking"],
        "notes": [
          {
            "enNote": "This idiom is often used in a sarcastic or dismissive manner.",
            "ptNote": "Este idiom é frequentemente usado de maneira sarcástica ou desdenhosa."
          }
        ]
      },
      {
        "word": "drop the ball",
        "partOfSpeech": "idiom",
        "enDefinition": "to make a mistake or fail to do something important",
        "ptDefinition": "cometer um erro ou falhar em fazer algo importante",
        "examples": [
          {
            "enExample": "He really dropped the ball when he forgot to submit the report on time.",
            "ptExample": "Ele realmente cometeu um erro quando esqueceu de enviar o relatório a tempo."
          },
          {
            "enExample": "The team dropped the ball in the final minutes of the game.",
            "ptExample": "O time falhou nos minutos finais do jogo."
          }
        ],
        "synonyms": ["make a mistake", "mess up", "blunder"],
        "antonyms": ["succeed", "perform well", "excel"],
        "seeAlso": ["slip up", "screw up"],
        "notes": [
          {
            "enNote": "This idiom is often used to describe a failure to meet expectations or responsibilities.",
            "ptNote": "Este idiom é frequentemente usado para descrever uma falha em atender expectativas ou responsabilidades."
          }
        ]
      },
      {
        "word": "dot your i's and cross your t's",
        "phonetics": "",
        "partOfSpeech": "idiom",
        "enDefinition": "to pay attention to every small detail, to be thorough and meticulous",
        "ptDefinition": "prestar atenção a cada pequeno detalhe, ser minucioso e meticuloso",
        "examples": [
          {
            "enExample": "When preparing the contract, make sure to dot your i's and cross your t's.",
            "ptExample": "Ao preparar o contrato, certifique-se de prestar atenção a cada detalhe."
          },
          {
            "enExample": "She always dots her i's and crosses her t's, which is why her work is so accurate.",
            "ptExample": "Ela sempre presta atenção a cada detalhe, por isso seu trabalho é tão preciso."
          }
        ],
        "synonyms": ["be meticulous", "be thorough", "pay attention to detail"],
        "antonyms": ["be careless", "overlook details", "be negligent"],
        "seeAlso": ["be precise", "be exact"],
        "notes": [
          {
            "enNote": "This idiom is often used to emphasize the importance of attention to detail in tasks.",
            "ptNote": "Este idiom é frequentemente usado para enfatizar a importância da atenção aos detalhes nas tarefas."
          }
        ]
      },
      {
        "word": "determine",
        "phonetics": "/dɪˈtɜːrmɪn/",
        "partOfSpeech": "verb",
        "enDefinition": "to establish or ascertain something, often through research or calculation",
        "ptDefinition": "determinar ou estabelecer algo, muitas vezes através de pesquisa ou cálculo",
        "examples": [
          {
            "enExample": "The test results will determine the next steps in the treatment.",
            "ptExample": "Os resultados do teste determinarão os próximos passos no tratamento."
          },
          {
            "enExample": "She was determined to succeed in her career.",
            "ptExample": "Ela estava determinada a ter sucesso em sua carreira."
          }
        ],
        "synonyms": ["ascertain", "decide", "establish"],
        "antonyms": ["doubt", "hesitate", "ignore"],
        "seeAlso": ["determination", "determinant"],
        "notes": [
          {
            "enNote": "The word 'determine' can also imply a strong sense of resolve or decision-making.",
            "ptNote": "A palavra 'determinar' também pode implicar um forte senso de resolução ou tomada de decisão."
          }
        ]
      },
      {
        "word": "dozen",
        "phonetics": "/ˈdʌzən/",
        "partOfSpeech": "noun",
        "enDefinition": "a group or set of twelve",
        "ptDefinition": "um grupo ou conjunto de doze",
        "examples": [
          {
            "enExample": "She bought a dozen eggs from the grocery.",
            "ptExample": "Ela comprou uma dúzia de ovos na mercado."
          },
          {
            "enExample": "There were a dozen cookies in the jar.",
            "ptExample": "Havia uma dúzia de biscoitos no pote."
          }
        ],
        "synonyms": ["twelve"],
        "antonyms": [],
        "seeAlso": ["dozens"],
        "notes": [
          {
            "enNote": "The term 'dozen' is often used to describe a quantity of twelve items.",
            "ptNote": "O termo 'dúzia' é frequentemente usado para descrever uma quantidade de doze itens."
          }
        ]
      },
      {
        "word": "disappointed",
        "phonetics": "/ˌdɪsəˈpɔɪntɪd/",
        "partOfSpeech": "adjective",
        "enDefinition": "feeling sad or displeased because someone or something has failed to fulfill one's hopes or expectations",
        "ptDefinition": "sentindo-se triste ou decepcionado(a) porque alguém ou algo não atendeu às suas esperanças ou expectativas; desapontado(a)",
        "examples": [
          {
            "enExample": "She was disappointed with the results of the exam.",
            "ptExample": "Ela ficou desapontada com os resultados da prova."
          },
          {
            "enExample": "He felt disappointed when his team lost the match.",
            "ptExample": "Ele ficou decepcionado quando seu time perdeu o jogo."
          }
        ],
        "synonyms": ["dismayed", "disheartened", "let down"],
        "antonyms": ["pleased", "satisfied", "content"],
        "seeAlso": ["disappoint", "disappointment"],
        "notes": [
          {
            "ptNote": "decepcionado(a): que sofreu uma decepção; desiludido(a) / desapontado(a): furstado(a) em seu objetivo ou em suas esperanças, envergonhado(a)"
          }
        ]
      },
      {
        "word": "disappoint",
        "phonetics": "/ˌdɪsəˈpɔɪnt/",
        "partOfSpeech": "verb",
        "enDefinition": "to fail to fulfill the hopes or expectations of someone",
        "ptDefinition": "falhar em atender as esperanças ou expectativas de alguém; desapontar",
        "examples": [
          {
            "enExample": "The movie did not disappoint; it was as good as the reviews said.",
            "ptExample": "O filme não decepcionou; foi tão bom quanto as críticas disseram."
          }
        ],
        "synonyms": ["let down", "dissatisfy", "disillusion"],
        "antonyms": ["satisfy", "please", "fulfill"],
        "seeAlso": ["disappointment", "disappointing"],
        "notes": [
          {
            "enNote": "The word 'disappoint' is often used when someone or something does not meet expectations.",
            "ptNote": "A palavra 'decepcionar' é frequentemente usada quando alguém ou algo não atende às expectativas."
          }
        ]
      },
      {
        "word": "deliver",
        "phonetics": "dɪˈlɪvər",
        "partOfSpeech": "verb",
        "enDefinition": "to bring or transport something to a destination, or to fulfill an obligation or promise",
        "ptDefinition": "levar ou transportar algo a um destino, ou cumprir uma obrigação ou promessa",
        "examples": [
          {
            "enExample": "The company promises to deliver your order within two days.",
            "ptExample": "A empresa promete entregar seu pedido dentro de dois dias."
          },
          {
            "enExample": "He always delivers excellent results on time.",
            "ptExample": "Ele sempre entrega resultados excelentes dentro do prazo."
          }
        ],
        "synonyms": ["provide", "supply", "bring"],
        "antonyms": ["withhold", "keep", "retain"],
        "notes": [
          {
            "enNote": "In a broader sense, 'deliver' can also mean to perform or achieve something successfully, such as delivering a speech or a presentation.",
            "ptNote": "Em um sentido mais amplo, 'deliver' também pode significar realizar ou alcançar algo com sucesso, como fazer um discurso ou uma apresentação."
          }
        ]
      },
      {
        "word": "drum up business",
        "phonetics": "/drʌm ʌp ˈbɪznəs/",
        "partOfSpeech": "idiom",
        "enDefinition": "to generate or increase business, often through activities like advertising, networking, or promotions",
        "ptDefinition": "aumentar ou gerar negócios, muitas vezes por meio de atividades como publicidade, networking ou promoções",
        "examples": [
          {
            "enExample": "The company is working hard to drum up business by offering discounts to new customers.",
            "ptExample": "A empresa está se esforçando para atrair mais negócios oferecendo descontos para novos clientes."
          },
          {
            "enExample": "They organized a special event to drum up business for their new store.",
            "ptExample": "Eles organizaram um evento especial para atrair mais clientes para a nova loja."
          }
        ],
        "synonyms": ["increase sales", "attract customers"],
        "antonyms": ["lose business", "decline", "reduce sales"],
        "seeAlso": "",
        "notes": [
          {
            "enNote": "This phrase is commonly used in business contexts to describe efforts aimed at bringing in new customers or clients."
          },
          {
            "ptNote": "Esta expressão é comumente usada em contextos de negócios para descrever esforços voltados para atrair novos clientes ou consumidores."
          }
        ]
      },
      {
        "word": "dud",
        "phonetics": "/dʌd/",
        "partOfSpeech": "noun",
        "enDefinition": "something that is a failure or does not work as intended",
        "ptDefinition": "algo que é um fracasso ou não funciona como o esperado",
        "examples": [
          {
            "enExample": "The new gadget turned out to be a dud, it broke after one use.",
            "ptExample": "O novo dispositivo acabou sendo um fracasso, quebrou após o primeiro uso."
          }
        ],
        "synonyms": ["failure", "flop", "bust"],
        "antonyms": ["success", "hit", "winner"]
      },
      {
        "word": "do whatever it takes",
        "partOfSpeech": "idiom",
        "enDefinition": "to do everything necessary to achieve a goal, even if it requires significant effort or sacrifice",
        "ptDefinition": "fazer tudo o que for preciso para alcançar um objetivo, mesmo que exija muito esforço ou sacrifício",
        "examples": [
          {
            "enExample": "The team is ready to do whatever it takes to meet the tight deadline.",
            "ptExample": "A equipe está disposta a fazer o que for necessário para cumprir o prazo apertado."
          },
          {
            "enExample": "He was determined to succeed and would do whatever it takes to make his dream a reality.",
            "ptExample": "Ele estava determinado a ter sucesso e faria de tudo para tornar seu sonho realidade."
          }
        ],
        "synonyms": ["pull out all the stops", "go all out", "spare no effort"],
        "antonyms": ["give up", "hold back", "limit effort"],
        "notes": [
          {
            "enNote": "This expression is often used to convey a strong sense of determination and commitment."
          },
          {
            "ptNote": "Esta expressão é frequentemente usada para transmitir um forte senso de determinação e comprometimento."
          }
        ]
      },
      {
        "word": "deaf",
        "phonetics": "/def/",
        "partOfSpeech": "adjective",
        "enDefinition": "lacking the power of hearing or having impaired hearing",
        "ptDefinition": "sem a capacidade de ouvir ou com audição prejudicada; surdo",
        "examples": [
          {
            "enExample": "She has been deaf since birth.",
            "ptExample": "Ela é surda desde o nascimento."
          },
          {
            "enExample": "He communicates with his deaf friends using sign language.",
            "ptExample": "Ele se comunica com seus amigos surdos usando a linguagem de sinais."
          }
        ],
        "synonyms": ["hearing-impaired", "unhearing"],
        "antonyms": ["hearing"],
        "seeAlso": ["deafness", "hard of hearing"],
        "notes": [
          {
            "enNote": "The term 'deaf' can refer to a range of hearing loss, from partial to complete.",
            "ptNote": "O termo 'surdo' pode se referir a uma variedade de perdas auditivas, desde parcial até completa."
          }
        ]
      },
      {
        "word": "deafness",
        "phonetics": "/'def.nəs/",
        "partOfSpeech": "noun",
        "enDefinition": "the state of being deaf",
        "ptDefinition": "surdez",
        "examples": [
          {
            "enExample": "She was finally diagnosed with profound deafness at 19 months.",
            "ptExample": "Such tumours occur in one of the nerves in the brain and can lead to deafness in one ear."
          }
        ]
      },
      {
        "word": "deadliest",
        "phonetics": "/ˈded.liəst/",
        "partOfSpeech": "superlative of deadly",
        "ptDefinition": "mais mortal",
        "examples": [
          {
            "enExample": "The Spanish Flu pandemic of 1918 is considered one of the deadliest in human history, with an estimated 50 million deaths worldwide.",
            "ptExample": "A pandemia de gripe espanhola de 1918 é considerada uma das mais mortais da história humana, com um número estimado de 50 milhões de mortes em todo o mundo."
          },
          {
            "enExample": "Mount Vesuvius's eruption in AD 79 is among the deadliest volcanic eruptions ever recorded, burying the cities of Pompeii and Herculaneum under ash and rock.",
            "ptExample": "A erupção do Monte Vesúvio em 79 d.C. está entre as erupções vulcânicas mais mortais já registradas, enterrando as cidades de Pompeia e Herculano sob cinzas e rochas."
          },
          {
            "enExample": "The Battle of Stalingrad during World War II was one of the deadliest battles, resulting in nearly two million casualties.",
            "ptExample": "A Batalha de Stalingrado durante a Segunda Guerra Mundial foi uma das batalhas mais mortais, resultando em quase dois milhões de baixas."
          },
          {
            "enExample": "The bubonic plague, or Black Death, was one of the deadliest pandemics, killing an estimated 25 million people in 14th-century Europe.",
            "ptExample": "A peste bubônica, ou Peste Negra, foi uma das pandemias mais mortais, matando cerca de 25 milhões de pessoas na Europa do século XIV."
          }
        ]
      },
      {
        "word": "debris",
        "phonetics": "/dəˈbriː/",
        "partOfSpeech": "noun",
        "enDefinition": "broken or torn pieces of something larger",
        "ptDefinition": "escombros, entulho",
        "examples": [
          {
            "enExample": "Debris from the aircraft was scattered over a large area.",
            "ptExample": "Destroços da aeronave foram espalhados por uma grande área."
          }
        ],
        "synonyms": ["detritus"]
      },
      {
        "word": "dream up",
        "phonetics": "/driːm ʌp/",
        "partOfSpeech": "phrasal verb",
        "enDefinition": "to imagine or invent something, especially something creative or unusual",
        "ptDefinition": "imaginar ou inventar algo, especialmente algo criativo ou incomum",
        "examples": [
          {
            "enExample": "She managed to dream up an innovative solution to the problem.",
            "ptExample": "Ela conseguiu imaginar uma solução inovadora para o problema."
          },
          {
            "enExample": "The advertising team dreamed up a catchy slogan for the new product.",
            "ptExample": "A equipe de publicidade inventou um slogan chamativo para o novo produto."
          }
        ],
        "synonyms": ["invent", "create", "conceive"],
        "antonyms": ["copy", "replicate", "imitate"]
      },
      {
        "word": "delicious",
        "phonetics": "/dɪ'lɪʃ.əs/",
        "partOfSpeech": "adjective",
        "enDefinition": "highly pleasant to the taste",
        "ptDefinition": "delicioso",
        "examples": [
          {
            "enExample": "The cake she baked was absolutely delicious.",
            "ptExample": "O bolo que ela fez estava absolutamente delicioso."
          }
        ],
        "synonyms": ["tasty", "delectable"],
        "antonyms": ["unpalatable", "tasteless"],
        "seeAlso": ["scrumptious", "mouth-watering"]
      },
      {
        "word": "dulce de leche",
        "phonetics": "/ˌdʌl.seɪ də ˈletʃ.eɪ/",
        "partOfSpeech": "noun",
        "enDefinition": "a sweet food, originally from Latin America, made from milk that has been caramelized until it becomes sweet and brown",
        "examples": [
          {
            "enExample": "The dessert was a dulce de leche and vanilla ice cream.",
            "ptExample": "A sobremesa era doce de leite e sorvete de baunilha."
          }
        ]
      }
    ]
  }
]
