[
  {
    "definitions": [
      {
        "word": "get real!",
        "partOfSpeech": "idiom",
        "enDefinition": "used to tell someone to stop being unrealistic, naive, or overly idealistic; to face reality or be more practical.",
        "ptDefinition": "usado para dizer a alguém para parar de ser irrealista, ingênuo ou idealista demais; para encarar a realidade ou ser mais prático.",
        "examples": [
          {
            "enExample": "You think you can learn a new language in two days? Get real!",
            "ptExample": "Você acha que pode aprender um novo idioma em dois dias? Cai na real!"
          },
          {
            "enExample": "Get real — there’s no way we can finish this project by tomorrow.",
            "ptExample": "Cai na real — não há como terminar este projeto até amanhã."
          }
        ],
        "synonyms": [
          "be realistic",
          "face reality",
          "wake up",
          "come to your senses"
        ],
        "antonyms": ["daydream", "be unrealistic", "fantasize"],
        "seeAlso": ["come on!", "be practical", "face the facts"],
        "notes": [
          {
            "enNote": "Often said in informal conversations to express disbelief or to urge someone to be more realistic.",
            "ptNote": "Usado em conversas informais para expressar descrença ou incentivar alguém a ser mais realista."
          }
        ]
      },
      {
        "word": "give someone the ax",
        "partOfSpeech": "idiom",
        "enDefinition": "to dismiss or fire someone from a job; to end someone’s employment or relationship suddenly and decisively",
        "ptDefinition": "demitir alguém de um emprego; encerrar o vínculo de forma repentina e definitiva",
        "examples": [
          {
            "enExample": "After months of poor performance, the manager finally gave him the ax.",
            "ptExample": "Após meses de baixo desempenho, o gerente finalmente o demitiu."
          },
          {
            "enExample": "The company gave dozens of workers the ax due to budget cuts.",
            "ptExample": "A empresa demitiu dezenas de funcionários devido a cortes orçamentários."
          },
          {
            "enExample": "She gave her boyfriend the ax after finding out he was lying to her.",
            "ptExample": "Ela terminou com o namorado depois de descobrir que ele estava mentindo para ela."
          }
        ],
        "synonyms": ["fire", "dismiss", "lay off", "sack", "terminate"],
        "antonyms": ["hire", "employ", "promote", "retain"],
        "seeAlso": ["give someone their walking papers", "let go", "cut ties"],
        "notes": [
          {
            "enNote": "An informal expression often used both for job dismissals and the end of personal relationships.",
            "ptNote": "Expressão informal usada tanto para demissões quanto para términos de relacionamentos pessoais."
          },
          {
            "enNote": "The spelling ‘give someone the axe’ is also common, especially in British English.",
            "ptNote": "A grafia ‘give someone the axe’ também é comum, especialmente no inglês britânico."
          }
        ]
      },
      {
        "word": "give someone the creeps",
        "partOfSpeech": "idiom",
        "enDefinition": "to make someone feel uncomfortable, nervous, or frightened, usually because something seems strange or unpleasant",
        "ptDefinition": "causar desconforto, nervosismo ou medo em alguém, geralmente porque algo parece estranho ou desagradável",
        "examples": [
          {
            "enExample": "That old abandoned house gives me the creeps.",
            "ptExample": "Aquela casa velha e abandonada me dá arrepios."
          },
          {
            "enExample": "The way he stares at people really gives me the creeps.",
            "ptExample": "O jeito que ele fica encarando as pessoas realmente me dá arrepios."
          },
          {
            "enExample": "Spiders give her the creeps, especially the big ones.",
            "ptExample": "Aranhas dão arrepios nela, especialmente as grandes."
          }
        ],
        "synonyms": ["creep out", "make uneasy", "spook", "scare"],
        "antonyms": ["comfort", "reassure", "calm"],
        "seeAlso": [
          "send shivers down one’s spine",
          "freak out",
          "feel uneasy"
        ],
        "notes": [
          {
            "enNote": "Often used in informal speech when describing something or someone that causes a feeling of fear or disgust. The phrase can describe both physical sensations (like shivers) and emotional discomfort.",
            "ptNote": "Usado frequentemente em linguagem informal para descrever algo ou alguém que causa medo ou repulsa. A expressão pode descrever tanto sensações físicas (como arrepios) quanto desconforto emocional."
          }
        ]
      },
      {
        "word": "gondola",
        "phonetics": "/ˈɡɑːn.dəl.ə/ US /ˈɡɒn.dələ/ UK",
        "partOfSpeech": "noun",
        "enDefinition": "a long, narrow, flat-bottomed boat with a high prow and stern, used especially in Venice and propelled by a person standing at the stern using a single oar; also, a compartment suspended from an airship or a cable car",
        "ptDefinition": "um barco longo, estreito e de fundo chato, com proa e popa altas, usado especialmente em Veneza e movido por uma pessoa em pé na popa com um único remo; também, compartimento suspenso de um dirigível ou teleférico",
        "examples": [
          {
            "enExample": "We took a romantic ride in a gondola along the canals of Venice.",
            "ptExample": "Fizemos um passeio romântico de gôndola pelos canais de Veneza."
          },
          {
            "enExample": "The mountain gondola carried tourists up to the ski resort.",
            "ptExample": "A gôndola da montanha levou turistas até a estação de esqui."
          }
        ],
        "synonyms": ["boat", "barge", "cable car", "carriage"],
        "antonyms": ["raft", "canoe", "submarine"],
        "seeAlso": ["Venice", "canal", "cable car", "airship"],
        "notes": [
          {
            "enNote": "The gondola is a symbol of Venice and is traditionally painted black. In transportation, 'gondola' can also refer to the passenger compartment of a cable car or airship.",
            "ptNote": "A gôndola é um símbolo de Veneza e tradicionalmente é pintada de preto. Em transporte, 'gôndola' também pode se referir ao compartimento de passageiros de um teleférico ou dirigível."
          }
        ]
      },
      {
        "word": "garden",
        "phonetics": "/ˈɡɑːr.dən/",
        "partOfSpeech": "noun / verb",
        "enDefinition": "noun: a piece of ground, often near a house, used for growing flowers, vegetables, or fruit; verb: to cultivate or take care of a garden",
        "ptDefinition": "substantivo: um pedaço de terra, geralmente perto de uma casa, usado para cultivar flores, vegetais ou frutas; verbo: cultivar ou cuidar de um jardim",
        "examples": [
          {
            "enExample": "She spends her weekends working in the garden.",
            "ptExample": "Ela passa os fins de semana trabalhando no jardim."
          },
          {
            "enExample": "They garden together every spring, planting new flowers.",
            "ptExample": "Eles cuidam do jardim juntos toda primavera, plantando novas flores."
          }
        ],
        "synonyms": ["yard", "plot", "park", "cultivate", "grow"],
        "antonyms": ["wasteland", "neglect"],
        "seeAlso": ["gardener", "greenhouse", "landscape"],
        "notes": [
          {
            "enNote": "Gardens can be ornamental or used for growing food. The verb 'to garden' means to engage in gardening activities.",
            "ptNote": "Jardins podem ser ornamentais ou usados para cultivo de alimentos. O verbo 'cuidar do jardim' refere-se a atividades de jardinagem."
          }
        ]
      },
      {
        "word": "gush",
        "phonetics": "/ɡʌʃ/",
        "partOfSpeech": "verb / noun",
        "enDefinition": "verb: to flow out suddenly and in large amounts; to express feelings or praise in an enthusiastic or excessive way; noun: a sudden, rapid flow or outpouring",
        "ptDefinition": "verbo: jorrar ou fluir repentinamente em grande quantidade; expressar sentimentos ou elogios de forma entusiasmada ou exagerada; substantivo: um fluxo ou jorro repentino",
        "examples": [
          {
            "enExample": "Water gushed from the broken pipe, flooding the basement.",
            "ptExample": "A água jorrou do cano quebrado, inundando o porão."
          },
          {
            "enExample": "She gushed about her new job to everyone she met.",
            "ptExample": "Ela falou entusiasmada sobre o novo emprego para todos que encontrava."
          }
        ],
        "synonyms": "spurt, stream, pour, rave, enthuse",
        "antonyms": "dribble, trickle, restrain, understate",
        "seeAlso": "burst, overflow, effuse",
        "notes": [
          {
            "enNote": "Often used for liquids or for people expressing strong emotions or praise.",
            "ptNote": "Frequentemente usado para líquidos ou para pessoas que expressam emoções ou elogios intensos."
          }
        ]
      },
      {
        "word": "grasp",
        "phonetics": "/ɡræsp/",
        "partOfSpeech": "verb / noun",
        "enDefinition": "verb: to take and hold something firmly with your hands; to understand something fully; noun: a firm hold or understanding",
        "ptDefinition": "verbo: segurar algo firmemente com as mãos; compreender completamente algo; substantivo: um aperto firme ou compreensão",
        "examples": [
          {
            "enExample": "She grasped the rope tightly to avoid falling.",
            "ptExample": "Ela segurou a corda firmemente para não cair."
          },
          {
            "enExample": "He finally grasped the concept after hours of explanation.",
            "ptExample": "Ele finalmente compreendeu o conceito após horas de explicação."
          }
        ],
        "synonyms": "seize, grip, understand, comprehend",
        "antonyms": "release, let go, misunderstand",
        "seeAlso": "hold, clutch, comprehend",
        "notes": [
          {
            "enNote": "Can be used both physically (holding something) and mentally (understanding something).",
            "ptNote": "Pode ser usado tanto fisicamente (segurar algo) quanto mentalmente (compreender algo)."
          }
        ]
      },
      {
        "word": "greedy",
        "phonetics": "/ˈɡriːdi/",
        "partOfSpeech": "adjective",
        "enDefinition": "having or showing a selfish desire for wealth, possessions, or more than one needs or deserves",
        "ptDefinition": "ter ou demonstrar um desejo egoísta por riqueza, posses ou mais do que se necessita ou merece",
        "examples": [
          {
            "enExample": "The greedy businessman exploited his employees for profit.",
            "ptExample": "O empresário ganancioso explorou seus funcionários para obter lucro."
          }
        ],
        "synonyms": "avaricious, grasping, covetous, acquisitive, eager, rapacious, selfish, desirous",
        "antonyms": "generous, altruistic",
        "seeAlso": "selfish, covetous, rapacious",
        "notes": [
          {
            "enNote": "The word 'greedy' emphasizes an excessive desire for more than is needed or deserved.",
            "ptNote": "A palavra 'ganancioso' enfatiza um desejo excessivo por mais do que se precisa ou merece."
          }
        ]
      },
      {
        "word": "game changer",
        "partOfSpeech": "idiom",
        "enDefinition": "something that significantly changes the outcome, situation, or way something is done",
        "ptDefinition": "algo que muda significativamente o resultado, a situação ou a forma como algo é feito",
        "examples": [
          {
            "enExample": "The new technology was a real game changer for the industry.",
            "ptExample": "A nova tecnologia foi um verdadeiro divisor de águas para o setor."
          },
          {
            "enExample": "Her ideas turned out to be a game changer for the company’s success.",
            "ptExample": "As ideias dela acabaram sendo cruciais para o sucesso da empresa."
          }
        ],
        "synonyms": ["breakthrough", "revolution", "milestone"],
        "antonyms": ["minor detail", "nonfactor", "status quo"],
        "seeAlso": ["turning point", "paradigm shift"],
        "notes": [
          {
            "enNote": "Commonly used in business, sports, and technology to describe something that changes the rules or dynamics completely.",
            "ptNote": "Usado com frequência nos contextos de negócios, esportes e tecnologia para descrever algo que muda completamente as regras ou a dinâmica."
          }
        ]
      },
      {
        "word": "go back to the drawing board",
        "partOfSpeech": "idiom",
        "enDefinition": "to start planning something again because the previous attempt failed",
        "ptDefinition": "voltar ao início do planejamento porque a tentativa anterior falhou",
        "examples": [
          {
            "enExample": "Our proposal was rejected, so it's back to the drawing board.",
            "ptExample": "Nossa proposta foi rejeitada, então temos que voltar à estaca zero."
          },
          {
            "enExample": "The prototype didn't work, so the engineers had to go back to the drawing board.",
            "ptExample": "O protótipo não funcionou, então os engenheiros tiveram que começar do zero novamente."
          }
        ],
        "synonyms": ["start over", "rethink", "begin again"],
        "antonyms": ["move forward", "finalize", "complete"],
        "seeAlso": ["back to square one", "start from scratch"],
        "notes": [
          {
            "enNote": "This idiom is commonly used in business, design, and problem-solving contexts.",
            "ptNote": "Esse idiom é comumente usado em contextos de negócios, design e resolução de problemas."
          }
        ]
      },
      {
        "word": "get the ball rolling",
        "partOfSpeech": "idiom",
        "enDefinition": "to start an activity or process",
        "ptDefinition": "iniciar uma atividade ou processo",
        "examples": [
          {
            "enExample": "Let’s get the ball rolling on the new marketing campaign.",
            "ptExample": "Vamos começar a nova campanha de marketing."
          },
          {
            "enExample": "We need someone to get the ball rolling on the project.",
            "ptExample": "Precisamos de alguém para dar o pontapé inicial no projeto."
          }
        ],
        "synonyms": ["start", "initiate", "kick off"],
        "antonyms": ["stop", "halt", "delay"],
        "seeAlso": ["kick off", "set in motion"],
        "notes": [
          {
            "enNote": "Commonly used to encourage starting something important or long-awaited.",
            "ptNote": "Usado para incentivar o início de algo importante ou aguardado."
          }
        ]
      },
      {
        "word": "get something out of one’s system",
        "partOfSpeech": "idiom",
        "enDefinition": "to do or express something you’ve been wanting to, so you no longer feel the need to do it",
        "ptDefinition": "fazer ou dizer algo que se estava com vontade para deixar de sentir a necessidade de fazê-lo",
        "examples": [
          {
            "enExample": "She went on a solo trip to get the travel bug out of her system.",
            "ptExample": "Ela fez uma viagem sozinha para matar a vontade de viajar."
          },
          {
            "enExample": "Go ahead and cry if you need to get it out of your system.",
            "ptExample": "Pode chorar se quiser, para aliviar o que está sentindo."
          }
        ],
        "synonyms": ["let it out", "release emotions", "get it off your chest"],
        "antonyms": ["bottle up", "suppress", "hold in"],
        "seeAlso": ["get something off one’s chest", "vent", "blow off steam"],
        "notes": [
          {
            "enNote": "Often used to encourage someone to act on a strong emotion or urge so they can move on.",
            "ptNote": "Usado para incentivar alguém a agir sobre uma emoção ou vontade forte para poder seguir em frente."
          }
        ]
      },
      {
        "word": "get one’s foot in the door",
        "partOfSpeech": "idiom",
        "enDefinition": "to achieve an initial opportunity that can lead to further success",
        "ptDefinition": "conseguir uma oportunidade inicial que pode levar a mais sucesso no futuro",
        "examples": [
          {
            "enExample": "Internships are a great way to get your foot in the door of the industry.",
            "ptExample": "Estágios são uma ótima maneira de conseguir uma oportunidade inicial na indústria."
          },
          {
            "enExample": "He got his foot in the door by volunteering at the company.",
            "ptExample": "Ele conseguiu uma chance inicial ao fazer trabalho voluntário na empresa."
          }
        ],
        "synonyms": ["gain entry", "open doors", "secure an opportunity"],
        "antonyms": ["be locked out", "miss the chance"],
        "seeAlso": ["break into", "get started"],
        "notes": [
          {
            "enNote": "Often used in career and business contexts to describe initial breakthroughs.",
            "ptNote": "Usado frequentemente em contextos de carreira e negócios para descrever avanços iniciais."
          }
        ]
      },
      {
        "word": "go-getter",
        "phonetics": "/ˈɡoʊˌɡɛtər/",
        "partOfSpeech": "noun",
        "enDefinition": "a person who is energetic, determined, and eager to succeed",
        "ptDefinition": "uma pessoa enérgica, determinada e com vontade de ter sucesso",
        "examples": [
          {
            "enExample": "She's a real go-getter and quickly climbed the corporate ladder.",
            "ptExample": "Ela é realmente uma pessoa determinada e subiu rapidamente na hierarquia da empresa."
          },
          {
            "enExample": "We need a go-getter to lead this project to success.",
            "ptExample": "Precisamos de alguém proativo para levar esse projeto ao sucesso."
          }
        ],
        "synonyms": ["high achiever", "self-starter", "ambitious person"],
        "antonyms": ["slacker", "underachiever", "lazy person"],
        "seeAlso": ["self-starter", "driven"],
        "notes": [
          {
            "enNote": "Often used positively in business or career contexts.",
            "ptNote": "Frequentemente usada de forma positiva em contextos profissionais ou de carreira."
          }
        ]
      },
      {
        "word": "give someone their walking papers",
        "partOfSpeech": "idiom",
        "enDefinition": "to fire someone or tell them they are no longer needed",
        "ptDefinition": "demitir alguém ou informar que seus serviços não são mais necessários",
        "examples": [
          {
            "enExample": "After the last mistake, he was given his walking papers.",
            "ptExample": "Após o último erro, ele foi demitido."
          },
          {
            "enExample": "The company gave several employees their walking papers during the reorganization.",
            "ptExample": "A empresa demitiu vários funcionários durante a reestruturação."
          }
        ],
        "synonyms": ["fire", "dismiss", "let go"],
        "antonyms": ["hire", "employ", "promote"],
        "seeAlso": ["give someone the sack", "lay off"],
        "notes": [
          {
            "enNote": "Mainly used in informal or workplace contexts.",
            "ptNote": "Usado principalmente em contextos informais ou profissionais."
          }
        ]
      },
      {
        "word": "go the extra mile",
        "partOfSpeech": "idiom",
        "enDefinition": "to make more effort than is expected or required",
        "ptDefinition": "fazer mais esforço do que o esperado ou necessário",
        "examples": [
          {
            "enExample": "She always goes the extra mile to help her students succeed.",
            "ptExample": "Ela sempre se esforça além do esperado para ajudar seus alunos a terem sucesso."
          },
          {
            "enExample": "The customer service team went the extra mile to resolve the issue.",
            "ptExample": "A equipe de atendimento ao cliente fez um esforço extra para resolver o problema."
          }
        ],
        "synonyms": ["go above and beyond", "make an extra effort"],
        "antonyms": ["do the bare minimum", "cut corners"],
        "seeAlso": ["go above and beyond"],
        "notes": [
          {
            "enNote": "Used to describe dedication, especially in work or service contexts.",
            "ptNote": "Usado para descrever dedicação, especialmente em contextos de trabalho ou atendimento."
          }
        ]
      },
      {
        "word": "get up to speed",
        "partOfSpeech": "idiom",
        "enDefinition": "to become familiar with or informed about the latest developments",
        "ptDefinition": "ficar por dentro; se atualizar sobre os acontecimentos ou informações mais recentes",
        "examples": [
          {
            "enExample": "It took me a few days to get up to speed after returning from vacation.",
            "ptExample": "Levei alguns dias para me atualizar depois de voltar das férias."
          },
          {
            "enExample": "Let's meet before the project starts so you can get up to speed.",
            "ptExample": "Vamos nos reunir antes de o projeto começar para você ficar por dentro."
          }
        ],
        "synonyms": ["catch up", "get informed", "get updated"],
        "antonyms": ["fall behind", "be out of touch"],
        "seeAlso": "bring up to speed",
        "notes": [
          {
            "enNote": "Often used in professional or technical contexts.",
            "ptNote": "Frequentemente usada em contextos profissionais ou técnicos."
          }
        ]
      },
      {
        "word": "there’s something going around",
        "partOfSpeech": "idiom / expression",
        "enDefinition": "an illness or problem that is spreading among people",
        "ptDefinition": "uma doença ou problema que está se espalhando entre as pessoas",
        "examples": [
          {
            "enExample": "I think there’s something going around because several people at work are sick.",
            "ptExample": "Eu acho que tem alguma coisa rolando porque várias pessoas no trabalho estão doentes."
          },
          {
            "enExample": "There’s something going around that’s making everyone tired.",
            "ptExample": "Está circulando algo que está deixando todo mundo cansado."
          }
        ],
        "synonyms": ["spreading illness, epidemic, going viral"],
        "seeAlso": "catch something, come down with",
        "notes": [
          {
            "enNote": "Commonly used to refer to illnesses or problems affecting a group of people.",
            "ptNote": "Usado comumente para se referir a doenças ou problemas que afetam um grupo de pessoas."
          }
        ]
      },
      {
        "word": "get ahead",
        "phonetics": "ɡet əˈhed",
        "partOfSpeech": "to make progress or succeed, especially in one's career or life",
        "ptDefinition": "fazer progresso ou ter sucesso, especialmente na carreira ou na vida",
        "examples": [
          {
            "enExample": "She works hard to get ahead in her job.",
            "ptExample": "Ela trabalha duro para progredir no trabalho."
          },
          {
            "enExample": "If you want to get ahead, you need to take more risks.",
            "ptExample": "Se você quer progredir, precisa correr mais riscos."
          }
        ],
        "synonyms": ["advance, succeed, progress"],
        "antonyms": ["fall behind, fail, regress"],
        "seeAlso": "get ahead of, move up, climb the ladder",
        "notes": [
          {
            "enNote": "Commonly used in professional and personal contexts to indicate progress.",
            "ptNote": "Comumente usado em contextos profissionais e pessoais para indicar progresso."
          }
        ]
      },
      {
        "word": "grin and bear it",
        "partOfSpeech": "idiom",
        "enDefinition": "To accept a difficult or unpleasant situation without complaining, often with forced good humor.",
        "ptDefinition": "Aceitar uma situação difícil ou desagradável sem reclamar, geralmente com um sorriso forçado ou resignação.",
        "examples": [
          {
            "enExample": "The dentist appointment was painful, but I had to grin and bear it.",
            "ptExample": "A consulta no dentista foi dolorosa, mas tive que aguentar firme e sem reclamar."
          },
          {
            "enExample": "When his boss gave him extra work, he just grinned and bore it.",
            "ptExample": "Quando o chefe deu trabalho extra a ele, ele apenas suportou sem reclamar."
          }
        ],
        "synonyms": ["endure, tolerate, put up with it, bite the bullet"],
        "antonyms": ["complain, protest, give up"],
        "seeAlso": "suck it up, keep a stiff upper lip, swallow one's pride",
        "notes": [
          {
            "enNote": "This expression emphasizes endurance and self-control in unpleasant situations.",
            "ptNote": "A expressão enfatiza resistência e autocontrole em situações desagradáveis."
          }
        ]
      },
      {
        "word": "What goes around comes around",
        "partOfSpeech": "idiom",
        "enDefinition": "the idea that a person's actions, whether good or bad, will eventually have consequences for that person; similar to the concept of karma",
        "ptDefinition": "a ideia de que as ações de uma pessoa, sejam boas ou ruins, eventualmente terão consequências para ela; semelhante ao conceito de carma",
        "examples": [
          {
            "enExample": "He was always kind to others, and now people are helping him—what goes around comes around.",
            "ptExample": "Ele sempre foi gentil com os outros, e agora as pessoas estão ajudando ele—o que vai, volta."
          },
          {
            "enExample": "She cheated her friends, but eventually lost their trust. What goes around comes around.",
            "ptExample": "Ela enganou os amigos, mas acabou perdendo a confiança deles. O que vai, volta."
          }
        ],
        "synonyms": ["karma", "you reap what you sow", "just deserts"],
        "antonyms": ["no consequences", "unpunished", "unrewarded"],
        "seeAlso": ["tit for tat", "reap what you sow", "cause and effect"]
      },
      {
        "word": "he’ll get his / she’ll get hers",
        "partOfSpeech": "idiom",
        "enDefinition": "used to say that someone will eventually receive the punishment or consequences they deserve for their actions, especially if they have done something wrong or unfair",
        "ptDefinition": "usado para dizer que alguém eventualmente receberá o que merece, especialmente se fez algo errado ou injusto",
        "examples": [
          {
            "enExample": "Don’t worry about the way he treated you—he’ll get his sooner or later.",
            "ptExample": "Não se preocupe com a forma como ele te tratou — ele vai receber o que merece mais cedo ou mais tarde."
          },
          {
            "enExample": "She thinks she can cheat people and get away with it, but she’ll get hers in the end.",
            "ptExample": "Ela acha que pode enganar as pessoas e sair impune, mas vai receber o que merece no final."
          }
        ],
        "synonyms": ["get what's coming", "face consequences", "pay the price"],
        "antonyms": ["get away with", "escape punishment"],
        "seeAlso": ["just deserts", "what goes around comes around"],
        "notes": [
          {
            "enNote": "This idiom is often used to reassure someone that justice or karma will eventually catch up with a wrongdoer.",
            "ptNote": "Este idiom é frequentemente usado para tranquilizar alguém de que a justiça ou o karma eventualmente alcançará quem fez algo errado."
          }
        ]
      },
      {
        "word": "get to the bottom of something",
        "partOfSpeech": "idiom",
        "enDefinition": "to find out the real cause or reason for something, often by thoroughly investigating",
        "ptDefinition": "descobrir a verdadeira causa ou razão de algo, geralmente por meio de uma investigação detalhada",
        "examples": [
          {
            "enExample": "The manager is determined to get to the bottom of the issue with the delayed shipments.",
            "ptExample": "O gerente está determinado a descobrir a causa do problema com os atrasos nas entregas."
          },
          {
            "enExample": "We need to get to the bottom of why sales have been declining over the past few months.",
            "ptExample": "Precisamos entender de fato por que as vendas têm diminuído nos últimos meses."
          }
        ],
        "synonyms": ["investigate", "uncover", "figure out"],
        "antonyms": ["ignore", "neglect", "overlook"],
        "seeAlso": [],
        "notes": [
          {
            "enNote": "This idiom is often used in problem-solving contexts where understanding the root cause is essential.",
            "ptNote": "Este idiom é frequentemente usado em contextos de resolução de problemas, onde entender a causa raiz é essencial."
          }
        ]
      },
      {
        "word": "go cold turkey",
        "partOfSpeech": "idiom",
        "enDefinition": "to suddenly and completely stop using an addictive substance or engaging in a habitual behavior",
        "ptDefinition": "parar abruptamente e completamente de usar uma substância viciante ou um comportamento habitual",
        "examples": [
          {
            "enExample": "He decided to go cold turkey and quit smoking immediately.",
            "ptExample": "Ele decidiu parar de uma vez e deixou de fumar imediatamente."
          },
          {
            "enExample": "Going cold turkey on caffeine can cause withdrawal headaches.",
            "ptExample": "Parar de consumir cafeína abruptamente pode causar dores de cabeça."
          }
        ],
        "synonyms": ["quit abruptly", "stop suddenly", "withdraw completely"],
        "antonyms": ["wean off", "gradually reduce", "taper off"],
        "seeAlso": ["withdrawal", "addiction", "quit"],
        "notes": [
          {
            "enNote": "This phrase originated in the early 20th century, possibly referring to the cold, clammy skin during drug withdrawal.",
            "ptNote": "Esta frase originou-se no início do século XX, possivelmente referindo-se à pele fria e úmida durante a abstinência de drogas."
          }
        ]
      },
      {
        "word": "go on about",
        "partOfSpeech": "phrasal verb",
        "phonetics": "/ɡoʊ ɑn əˈbaʊt/",
        "enDefinition": "to talk at length about something, often in a way that is boring or annoying to others",
        "ptDefinition": "falar longamente sobre algo, muitas vezes de uma maneira que é chata ou irritante para os outros",
        "examples": [
          {
            "enExample": "He went on about his vacation for hours, and everyone was getting bored.",
            "ptExample": "Ele falou sobre suas férias por horas, e todos estavam ficando entediados."
          },
          {
            "enExample": "She can go on about her favorite TV show for ages.",
            "ptExample": "Ela pode falar sobre seu programa de TV favorito por muito tempo."
          }
        ],
        "synonyms": ["ramble", "drone on", "talk endlessly"],
        "antonyms": ["be concise", "summarize", "be brief"],
        "seeAlso": ["rant", "babble"],
        "notes": [
          {
            "enNote": "This phrase is often used to describe someone who is speaking in a way that others find tedious.",
            "ptNote": "Esta frase é frequentemente usada para descrever alguém que está falando de uma maneira que os outros acham tediosa."
          }
        ]
      },
      {
        "word": "get off track",
        "partOfSpeech": "idiom",
        "enDefinition": "to become distracted or lose focus on the main task or objective",
        "ptDefinition": "ficar distraído ou perder o foco na tarefa ou objetivo principal",
        "examples": [
          {
            "enExample": "We were making good progress on the project, but then we got off track with all the side discussions.",
            "ptExample": "Estávamos fazendo um bom progresso no projeto, mas então nos desviamos com todas as discussões paralelas."
          },
          {
            "enExample": "It's easy to get off track when there are so many distractions around.",
            "ptExample": "É fácil se desviar quando há tantas distrações ao redor."
          }
        ],
        "synonyms": ["lose focus", "get distracted", "stray"],
        "antonyms": ["stay focused", "remain on track", "stay on course"],
        "seeAlso": ["lose sight of", "wander off"],
        "notes": [
          {
            "enNote": "This idiom is often used to describe situations where someone or something deviates from the intended path or goal.",
            "ptNote": "Este idiom é frequentemente usado para descrever situações em que alguém ou algo se desvia do caminho ou objetivo pretendido."
          }
        ]
      },
      {
        "word": "go",
        "phonetics": "/ɡoʊ/",
        "partOfSpeech": "verb",
        "enDefinition": "to move or travel from one place to another",
        "ptDefinition": "ir",
        "examples": [
          {
            "enExample": "I need to go to the store to buy some groceries.",
            "ptExample": "Eu preciso ir à loja para comprar mantimentos."
          },
          {
            "enExample": "She goes to work by bus every day.",
            "ptExample": "Ela vai para o trabalho de ônibus todos os dias."
          }
        ],
        "synonyms": ["move", "travel", "proceed"],
        "antonyms": ["stay", "remain", "stop"],
        "seeAlso": ["depart", "leave", "advance"]
      },
      {
        "word": "grateful",
        "phonetics": "/ˈɡreɪt.fəl/",
        "partOfSpeech": "adjective",
        "enDefinition": "feeling or showing an appreciation for something done or received",
        "ptDefinition": "sentindo ou mostrando apreço por algo feito ou recebido",
        "examples": [
          {
            "enExample": "She was grateful for the help she received from her friends.",
            "ptExample": "Ela estava grata pela ajuda que recebeu de seus amigos."
          },
          {
            "enExample": "I'm grateful for your support during this difficult time.",
            "ptExample": "Estou grato pelo seu apoio durante este momento difícil."
          }
        ],
        "synonyms": ["thankful", "appreciative", "obliged"],
        "antonyms": ["ungrateful", "thankless", "unappreciative"],
        "seeAlso": ["thankful", "appreciative"],
        "notes": [
          {
            "enNote": "Being grateful often involves recognizing the positive impact others have had on your life.",
            "ptNote": "Ser grato frequentemente envolve reconhecer o impacto positivo que os outros tiveram em sua vida."
          }
        ]
      },
      {
        "word": "goofy",
        "phonetics": "/ˈɡuː.fi/",
        "partOfSpeech": "adjective",
        "enDefinition": "silly or ridiculous, often in a way that is endearing or amusing",
        "ptDefinition": "bobo ou ridículo, muitas vezes de uma maneira cativante ou divertida",
        "examples": [
          {
            "enExample": "He made a goofy face to make the children laugh.",
            "ptExample": "Ele fez uma cara boba para fazer as crianças rirem."
          },
          {
            "enExample": "Her goofy sense of humor always lightens the mood.",
            "ptExample": "Seu senso de humor bobo sempre melhora o clima."
          }
        ],
        "synonyms": ["silly", "ridiculous", "absurd"],
        "antonyms": ["serious", "sensible", "solemn"],
        "seeAlso": ["funny", "comical", "whimsical"],
        "notes": [
          {
            "enNote": "The term 'goofy' is often used affectionately to describe someone who is playfully silly.",
            "ptNote": "O termo 'goofy' é frequentemente usado de forma carinhosa para descrever alguém que é brincalhão e bobo."
          }
        ]
      },
      {
        "word": "glad",
        "phonetics": "/ɡlæd/",
        "partOfSpeech": "adjective",
        "enDefinition": "feeling pleasure, joy, or happiness",
        "ptDefinition": "sentindo prazer, alegria ou felicidade",
        "examples": [
          {
            "enExample": "I'm so glad you came to the party.",
            "ptExample": "Estou tão feliz que você veio à festa."
          },
          {
            "enExample": "She was glad to hear the good news.",
            "ptExample": "Ela ficou feliz em ouvir as boas notícias."
          }
        ],
        "synonyms": ["happy", "pleased", "delighted"],
        "antonyms": ["sad", "unhappy", "displeased"],
        "seeAlso": ["joyful", "content", "cheerful"],
        "notes": [
          {
            "enNote": "The word 'glad' is often used to express a positive emotional response to something.",
            "ptNote": "A palavra 'glad' é frequentemente usada para expressar uma resposta emocional positiva a algo."
          }
        ]
      },
      {
        "word": "get down to business",
        "partOfSpeech": "idiom",
        "enDefinition": "To start focusing on the most important or serious part of something, usually after preliminary or less important tasks have been completed.",
        "ptDefinition": "Começar a focar na parte mais importante ou séria de algo, geralmente depois que tarefas preliminares ou menos importantes foram concluídas.",
        "examples": [
          {
            "enExample": "After a brief introduction, the meeting finally got down to business and started discussing the main project goals.",
            "ptExample": "Depois de uma breve introdução, a reunião finalmente entrou no assunto e começou a discutir os principais objetivos do projeto."
          },
          {
            "enExample": "Let's get down to business and figure out how to solve this issue as quickly as possible.",
            "ptExample": "Vamos nos concentrar no trabalho e descobrir como resolver esse problema o mais rápido possível."
          }
        ],
        "synonyms": ["get to the point", "focus", "begin", "start working"],
        "antonyms": ["procrastinate", "waste time", "delay"],
        "seeAlso": ["business discussion", "focus", "priority tasks"],
        "notes": [
          {
            "enNote": "This phrase is commonly used to indicate that it's time to stop small talk or distractions and begin the main, serious part of a conversation or activity.",
            "ptNote": "Essa frase é comumente usada para indicar que é hora de parar com a conversa fiada ou distrações e começar a parte principal e séria de uma conversa ou atividade."
          }
        ]
      },
      {
        "word": "get buy-in (from)",
        "phonetics": "/ɡɛt baɪ ɪn frəm/",
        "partOfSpeech": "phrasal verb",
        "enDefinition": "to gain approval, support, or agreement from others, especially in a business or organizational context",
        "ptDefinition": "obter aprovação, apoio ou concordância de outras pessoas, especialmente em um contexto empresarial ou organizacional",
        "examples": [
          {
            "enExample": "We need to get buy-in from the team before we can proceed with the project.",
            "ptExample": "Precisamos obter o apoio da equipe antes de podermos prosseguir com o projeto."
          },
          {
            "enExample": "The manager worked hard to get buy-in from the stakeholders for the new initiative.",
            "ptExample": "O gerente trabalhou duro para obter a aprovação dos envolvidos para a nova iniciativa."
          }
        ],
        "synonyms": ["gain support", "win approval", "get agreement"],
        "antonyms": ["face opposition", "be rejected"]
      },
      {
        "word": "get right on something",
        "partOfSpeech": "idiom",
        "enDefinition": "to start doing something immediately or with great focus and attention",
        "ptDefinition": "começar a fazer algo imediatamente ou com grande foco e atenção",
        "examples": [
          {
            "enExample": "I'll get right on the report as soon as I finish this task.",
            "ptExample": "Eu vou começar o relatório assim que terminar essa tarefa."
          },
          {
            "enExample": "We need to get right on this project to meet the deadline.",
            "ptExample": "Precisamos começar este projeto imediatamente para cumprir o prazo."
          }
        ],
        "synonyms": ["get started", "tackle", "dive into"],
        "antonyms": ["delay", "procrastinate", "put off"],
        "notes": [
          {
            "enNote": "This idiom emphasizes urgency and prioritization, suggesting that the task at hand should be dealt with right away.",
            "ptNote": "Este idiom enfatiza urgência e priorização, sugerindo que a tarefa em questão deve ser tratada imediatamente."
          }
        ]
      },
      {
        "word": "get with the program",
        "partOfSpeech": "idiom",
        "enDefinition": "to understand or accept the current situation or way of doing things, especially when it is necessary for progress or success",
        "ptDefinition": "entender ou aceitar a situação atual ou a forma de fazer as coisas, especialmente quando isso é necessário para o progresso ou sucesso",
        "examples": [
          {
            "enExample": "You need to get with the program if you want to succeed in this industry.",
            "ptExample": "Você precisa se atualizar se quiser ter sucesso nesta indústria."
          },
          {
            "enExample": "Stop resisting change and get with the program—this is how things are done now.",
            "ptExample": "Pare de resistir à mudança e se atualize — é assim que as coisas funcionam agora."
          }
        ],
        "synonyms": ["get on board", "get in line", "accept the reality"],
        "antonyms": ["resist change", "be left behind", "not adapt"],
        "notes": [
          {
            "note": "This phrase is often used to encourage someone to adapt to new ideas, technologies, or approaches."
          },
          {
            "note": "Esta expressão é frequentemente usada para incentivar alguém a se adaptar a novas ideias, tecnologias ou abordagens."
          }
        ]
      },
      {
        "word": "get the job done",
        "partOfSpeech": "idiom",
        "enDefinition": "to complete a task or fulfill a responsibility successfully, regardless of challenges",
        "ptDefinition": "concluir uma tarefa ou cumprir uma responsabilidade com sucesso, apesar dos desafios",
        "examples": [
          {
            "enExample": "We may face some obstacles, but our team knows how to get the job done.",
            "ptExample": "Podemos enfrentar alguns obstáculos, mas nossa equipe sabe como fazer o trabalho acontecer."
          },
          {
            "enExample": "No matter how difficult it is, she always finds a way to get the job done.",
            "ptExample": "Não importa quão difícil seja, ela sempre encontra uma maneira de realizar a tarefa."
          }
        ],
        "synonyms": ["accomplish the task", "make it happen", "see it through"],
        "antonyms": ["fail to complete", "leave unfinished", "fall short"],
        "notes": [
          {
            "enNote": "This phrase emphasizes determination and reliability, often in professional or practical contexts."
          },
          {
            "ptNote": "Esta expressão enfatiza determinação e confiabilidade, frequentemente em contextos profissionais ou práticos."
          }
        ]
      },
      {
        "word": "generate lots of buzz",
        "partOfSpeech": "idiom",
        "enDefinition": "to create excitement, attention, or interest, often in a short period of time, usually through word-of-mouth or publicity",
        "ptDefinition": "gerar muita atenção ou empolgação, geralmente de forma rápida, publicidade ou boca a boca",
        "examples": [
          {
            "enExample": "The new product launch generated lots of buzz on social media, with people sharing their opinions and excitement.",
            "ptExample": "O lançamento do novo produto gerou muita atenção nas redes sociais, com as pessoas compartilhando suas opiniões e empolgação."
          }
        ],
        "synonyms": [
          "create excitement",
          "stir up interest",
          "spark attention"
        ],
        "antonyms": ["go unnoticed", "lack interest", "be ignored"],
        "notes": [
          {
            "enNote": "This phrase is often used in marketing and media to describe how something quickly becomes a topic of conversation."
          },
          {
            "ptNote": "Esta expressão é frequentemente usada em marketing e mídia para descrever como algo rapidamente se torna um tópico de conversa."
          }
        ]
      },
      {
        "word": "game plan",
        "partOfSpeech": "idiom",
        "enDefinition": "an action plan; a plan for how a project will proceed",
        "ptDefinition": "um plano de ação; um plano de como um projeto irá prosseguir",
        "examples": [
          {
            "enExample": "The software company's game plan is to expand its operations into China and India over the next year.",
            "ptExample": "O plano de ação da empresa de software é expandir suas operações para a China e a Índia ao longo do próximo ano."
          }
        ]
      },
      {
        "word": "gene",
        "phonetics": "dʒiːn",
        "partOfSpeech": "noun",
        "enDefinition": "a unit of heredity in a living organism, typically a segment of DNA or RNA, that determines specific traits or functions",
        "ptDefinition": "uma unidade de hereditariedade em um organismo vivo, tipicamente um segmento de DNA ou RNA, que determina características ou funções específicas",
        "examples": [
          {
            "enExample": "Scientists discovered a gene responsible for eye color.",
            "ptExample": "Cientistas descobriram um gene responsável pela cor dos olhos."
          },
          {
            "enExample": "The gene mutation led to a rare disorder.",
            "ptExample": "A mutação genética levou a uma desordem rara."
          },
          {
            "enExample": "Genes are passed from parents to their offspring.",
            "ptExample": "Os genes são transmitidos dos pais para seus descendentes."
          }
        ],
        "synonyms": ["hereditary unit", "DNA segment", "genetic material"],
        "antonyms": ["non-genetic factor"],
        "seeAlso": ["genetics", "genome", "chromosome"],
        "notes": [
          {
            "enNote": "Genes play a fundamental role in the inheritance of traits and biological diversity.",
            "ptNote": "Os genes desempenham um papel fundamental na herança de características e na diversidade biológica."
          }
        ]
      },
      {
        "word": "genome",
        "phonetics": "/ˈdʒiː.noʊm/",
        "partOfSpeech": "noun",
        "enDefinition": "the complete set of genetic material of a human, animal, plant, or other living thing",
        "ptDefinition": "genoma"
      },
      {
        "word": "genetic code",
        "partOfSpeech": "noun",
        "enDefinition": "the instructions contained in a gene that tell a cell how to make a specific protein",
        "ptDefinition": "código genético"
      },
      {
        "word": "get something off the ground",
        "partOfSpeech": "idiom",
        "enDefinition": "to get started on something, often a project",
        "ptDefinition": "começar algo, geralmente um projeto",
        "examples": [
          {
            "enExample": "We've been sitting around talking about this project for months. It's time to take action and get it off the ground!",
            "ptExample": "Ficamos discutindo este projeto por meses. É hora de agir e colocá-lo em prática!"
          }
        ]
      },
      {
        "word": "get to the bottom of something",
        "partOfSpeech": "idiom",
        "enDefinition": "to find out the real cause or reason for something, often by thoroughly investigating",
        "ptDefinition": "descobrir a verdadeira causa ou razão de algo, geralmente por meio de uma investigação detalhada",
        "examples": [
          {
            "enExample": "The manager is determined to get to the bottom of the issue with the delayed shipments.",
            "ptExample": "O gerente está determinado a descobrir a causa do problema com os atrasos nas entregas."
          },
          {
            "enExample": "We need to get to the bottom of why sales have been declining over the past few months.",
            "ptExample": "Precisamos entender de fato por que as vendas têm diminuído nos últimos meses."
          }
        ],
        "synonyms": ["investigate", "uncover", "figure out"],
        "antonyms": ["ignore", "neglect", "overlook"],
        "notes": [
          {
            "enNote": "This idiom is often used in problem-solving contexts where understanding the root cause is essential."
          },
          {
            "ptNote": "Este idiom é frequentemente usado em contextos de resolução de problemas, onde entender a causa raiz é essencial."
          }
        ]
      },
      {
        "word": "get wind of",
        "partOfSpeech": "idiom",
        "enDefinition": "to find out about something, often sensitive information",
        "ptDefinition": "descobrir algo, muitas vezes uma informação sensível",
        "examples": [
          {
            "enExample": "When the restaurant owner got wind of the fact that one of his waiters was stealing money from the cash register, he was furious.",
            "ptExample": "Quando o dono do restaurante soube que um de seus garçons estava roubando dinheiro do caixa, ficou furioso."
          }
        ]
      },
      {
        "word": "give a run for one's money",
        "phonetics": "",
        "partOfSpeech": "idiom",
        "enDefinition": "to challenge someone, providing strong competition or resistance; to make it difficult for someone to succeed or achieve something easily",
        "ptDefinition": "desafiar alguém, proporcionando forte competição ou resistência; dificultar para que alguém alcance algo facilmente",
        "examples": [
          {
            "enExample": "The underdog team gave the reigning champions a run for their money in the finals.",
            "ptExample": "O time azarão deu trabalho para os campeões na final."
          },
          {
            "enExample": "If you hire her, she'll give all the other employees a run for their money.",
            "ptExample": "Se você contratá-la, ela vai dar trabalho para todos os outros funcionários."
          }
        ],
        "synonyms": ["challenge", "compete with", "rival"],
        "antonyms": ["yield", "concede", "surrender"],
        "seeAlso": ["give someone a hard time", "hold one's own"]
      },
      {
        "word": "give it one's best shot",
        "partOfSpeech": "idiom",
        "enDefinition": "to try one's hardest or put forth maximum effort in an attempt to succeed",
        "ptDefinition": "tentar o máximo possível ou dar o melhor de si para ter sucesso",
        "examples": [
          {
            "enExample": "Even though it was a tough challenge, he gave it his best shot and passed the exam.",
            "ptExample": "Embora fosse um desafio difícil, ele deu o melhor de si e passou na prova."
          },
          {
            "enExample": "She gave it her best shot, but the performance still didn't go as planned.",
            "ptExample": "Ela deu o melhor de si, mas a apresentação ainda não saiu como o planejado."
          },
          {
            "enExample": "I'm not sure if I can do it, but I'll give it my best shot.",
            "ptExample": "Não tenho certeza se consigo fazer, mas vou dar o meu melhor."
          }
        ],
        "synonyms": ["try hard", "give one's all", "do one's best"],
        "antonyms": ["give up", "half-hearted attempt", "slack off"],
        "seeAlso": ["put in effort", "give one's all"],
        "notes": [
          {
            "enNote": "This idiom emphasizes putting in maximum effort, regardless of the outcome.",
            "ptNote": "Essa expressão enfatiza o ato de se esforçar ao máximo, independentemente do resultado."
          }
        ]
      },
      {
        "word": "give somebody the greenlight",
        "partOfSpeech": "idiom",
        "enDefinition": "to give someone permission or approval to proceed with a project, action, or idea",
        "ptDefinition": "dar a alguém permissão ou aprovação para seguir com um projeto, ação ou ideia",
        "examples": [
          {
            "enExample": "The manager gave the team the greenlight to start the new campaign.",
            "ptExample": "O gerente deu à equipe o sinal verde para começar a nova campanha."
          },
          {
            "enExample": "Once we get the greenlight from the board, we can proceed with construction.",
            "ptExample": "Assim que recebermos o sinal verde do conselho, podemos prosseguir com a construção."
          }
        ],
        "synonyms": ["approve", "authorize", "permit"],
        "antonyms": ["deny", "block", "refuse"],
        "seeAlso": ["give the go-ahead", "grant permission"]
      },
      {
        "word": "good",
        "phonetics": "/ɡʊd/",
        "partOfSpeech": "adjective",
        "enDefinition": "very satisfactory, enjoyable, pleasant, or interesting; successful, or able to do something well; kind or helpful",
        "ptDefinition": "bom",
        "examples": [
          {
            "enExample": "It's a good book.",
            "ptExample": "É um bom livro."
          },
          {
            "enExample": "Kate's a good cook.",
            "ptExample": "Kate é uma boa cozinheira."
          },
          {
            "enExample": "He's very good at geography.",
            "ptExample": "Ele é muito boa em geografia."
          },
          {
            "enExample": "She's very good with children.",
            "ptExample": "Ela é muito boa com crianças."
          },
          {
            "enExample": "He's a good friend.",
            "ptExample": "Ele é um bom amigo."
          }
        ]
      },
      {
        "word": "goods",
        "phonetics": "/ɡʊdz/",
        "partOfSpeech": "noun",
        "enDefinition": "things that are made to be sold",
        "ptDefinition": "mercadorias, bens",
        "examples": [
          {
            "enExample": "expensive goods",
            "ptExample": "bens caros"
          }
        ]
      },
      {
        "word": "good call",
        "partOfSpeech": "idiom",
        "enDefinition": "a wise or sensible decision or judgment",
        "ptDefinition": "uma decisão ou julgamento sábio ou sensato",
        "examples": [
          {
            "enExample": "Choosing to invest in renewable energy was a good call for the company.",
            "ptExample": "Optar por investir em energia renovável foi uma boa decisão para a empresa."
          },
          {
            "enExample": "It was a good call to delay the event until the weather improved.",
            "ptExample": "Foi uma boa decisão adiar o evento até o tempo melhorar."
          }
        ],
        "synonyms": ["wise decision", "smart move", "good judgment"],
        "antonyms": ["bad decision", "poor judgment", "mistake"],
        "notes": [
          {
            "enNote": "This idiom is often used to praise someone for making a smart or appropriate choice.",
            "ptNote": "Este idiom é frequentemente usado para elogiar alguém por tomar uma decisão inteligente ou apropriada."
          }
        ]
      },
      {
        "word": "go all out",
        "partOfSpeech": "idiom",
        "enDefinition": "this phrase means to put in maximum effort or to go to extremes in doing something",
        "ptDefinition": "esta expressão significa colocar o máximo de esforço ou ir ao extremo em algo",
        "examples": [
          {
            "enExample": "They decided to go all out with their wedding, hiring a famous band and booking an expensive venue.",
            "ptExample": "Eles decidiram se dedicar completamente ao casamento, contratando uma banda famosa e reservando um local caro."
          },
          {
            "enExample": "The company is going all out to win this contract, offering extra services and incentives.",
            "ptExample": "A empresa está se dedicando ao máximo para ganhar este contrato, oferecendo serviços extras e incentivos."
          }
        ],
        "synonyms": [
          "put in maximum effort",
          "go the extra mile",
          "spare no expense"
        ],
        "antonyms": ["hold back", "take it easy", "go easy"],
        "notes": [
          {
            "enNote": "This idiom is often used to describe situations where someone is fully committed to achieving a goal.",
            "ptNote": "Este idiom é frequentemente usado para descrever situações em que alguém está totalmente comprometido em alcançar um objetivo."
          }
        ]
      },
      {
        "word": "the grass is always greener on the other side",
        "partOfSpeech": "proverb",
        "enDefinition": "the circumstances of others seem more desirable than one's own but in reality often are not",
        "ptDefinition": "a grama do vizinho é sempre mais verde",
        "examples": [
          {
            "enExample": "<b>A:</b> It just seems like they have this perfect life, always traveling and spending time together. <b>B:</b> Hey, the grass is always greener. I'm sure they have their own problems that no one else can see.",
            "ptExample": "A: Parece que eles têm uma vida perfeita, sempre viajando e passando tempo juntos. B: Ei, a grama sempre parece mais verde. Tenho certeza de que eles têm seus próprios problemas que ninguém mais pode ver."
          }
        ]
      },
      {
        "word": "guerrilla marketing",
        "phonetics": "/ɡəˈrɪlə ˈmɑrkɪtɪŋ/",
        "partOfSpeech": "noun",
        "enDefinition": "a creative and unconventional approach to marketing that uses low-cost strategies to promote a product or service",
        "ptDefinition": "uma abordagem criativa e não convencional de marketing que utiliza estratégias de baixo custo para promover um produto ou serviço",
        "examples": [
          {
            "enExample": "The small business used guerrilla marketing to attract attention with street art campaigns.",
            "ptExample": "A pequena empresa utilizou marketing de guerrilha para atrair atenção com campanhas de arte de rua."
          },
          {
            "enExample": "Guerrilla marketing tactics often rely on surprise and creativity to engage audiences.",
            "ptExample": "As táticas de marketing de guerrilha frequentemente dependem de surpresa e criatividade para engajar o público."
          }
        ],
        "synonyms": [
          "unconventional marketing",
          "creative advertising",
          "grassroots marketing"
        ],
        "antonyms": ["traditional marketing", "conventional advertising"],
        "seeAlso": "",
        "notes": [
          {
            "enNote": "This term originates from the idea of guerrilla warfare, emphasizing unconventional and strategic actions."
          },
          {
            "ptNote": "Este termo vem da guerra de guerrilha, destacando ações não convencionais e estratégicas."
          }
        ]
      }
    ]
  }
]
