[
  {
    "definitions": [
      {
        "word": "make a pig of oneself",
        "partOfSpeech": "idiom",
        "enDefinition": "to eat too much or behave in a greedy or excessive way, especially when eating",
        "ptDefinition": "comer demais; exagerar na comida; comportar-se de maneira gulosa ou excessiva",
        "examples": [
          {
            "enExample": "I really made a pig of myself at the buffet last night.",
            "ptExample": "Eu realmente exagerei na comida no buffet ontem à noite."
          },
          {
            "enExample": "He made a pig of himself at the party and felt sick afterward.",
            "ptExample": "Ele comeu demais na festa e passou mal depois."
          }
        ],
        "synonyms": ["overeat", "stuff oneself", "pig out"],
        "antonyms": ["eat moderately", "control oneself"],
        "seeAlso": ["pig out", "overeat"],
        "notes": [
          {
            "enNote": "Informal expression often used humorously to admit eating too much.",
            "ptNote": "Expressão informal frequentemente usada de forma humorística para admitir que comeu demais."
          }
        ]
      },
      {
        "word": "make time for",
        "partOfSpeech": "verb phrase",
        "enDefinition": "to deliberately find or create time in your schedule to do something or spend time with someone",
        "ptDefinition": "arranjar tempo para algo ou alguém; reservar tempo intencionalmente na agenda",
        "examples": [
          {
            "enExample": "She always makes time for her family despite her busy schedule.",
            "ptExample": "Ela sempre arranja tempo para a família apesar da agenda cheia."
          },
          {
            "enExample": "You should make time for exercise during the week.",
            "ptExample": "Você deveria arranjar tempo para se exercitar durante a semana."
          }
        ],
        "synonyms": ["find time for", "set aside time for", "take time for"],
        "antonyms": ["neglect", "ignore", "have no time for"],
        "seeAlso": ["make time", "fit someone in", "set aside"],
        "notes": [
          {
            "enNote": "Commonly used when emphasizing effort or intention to prioritize something or someone.",
            "ptNote": "Usado frequentemente para enfatizar o esforço ou a intenção de priorizar algo ou alguém."
          }
        ]
      },
      {
        "word": "make a splash",
        "partOfSpeech": "idiom",
        "enDefinition": "to attract a lot of attention or create a strong impression, especially when something is new or first introduced",
        "ptDefinition": "chamar muita atenção; causar grande impacto ou impressão, especialmente ao ser lançado ou apresentado",
        "examples": [
          {
            "enExample": "The new startup made a splash at the tech conference.",
            "ptExample": "A nova startup causou grande impacto na conferência de tecnologia."
          },
          {
            "enExample": "Her debut novel made a big splash in the literary world.",
            "ptExample": "O romance de estreia dela chamou muita atenção no mundo literário."
          }
        ],
        "synonyms": ["cause a sensation", "create a buzz", "make waves"],
        "antonyms": ["go unnoticed", "pass unnoticed", "fly under the radar"],
        "seeAlso": ["make waves", "take (something) by storm", "cause a stir"],
        "notes": [
          {
            "enNote": "Often used in media, marketing, and entertainment to describe a successful or attention-grabbing launch.",
            "ptNote": "Frequentemente usado em mídia, marketing e entretenimento para descrever um lançamento bem-sucedido ou chamativo."
          }
        ]
      },
      {
        "word": "made of money",
        "partOfSpeech": "idiom",
        "enDefinition": "used to say that someone has a lot of money or can easily afford to spend money",
        "ptDefinition": "usado para dizer que alguém tem muito dinheiro ou pode gastar dinheiro com facilidade",
        "examples": [
          {
            "enExample": "I can’t just buy a new phone — I’m not made of money.",
            "ptExample": "Não posso simplesmente comprar um celular novo — eu não sou feito de dinheiro."
          },
          {
            "enExample": "Do you think I’m made of money?",
            "ptExample": "Você acha que eu sou rico?"
          }
        ],
        "synonyms": ["be rich", "have plenty of money", "have money to burn"],
        "antonyms": ["be broke", "be short of money", "be on a tight budget"],
        "seeAlso": ["money to burn", "tight budget", "shell out"],
        "notes": [
          {
            "enNote": "Very often used in the negative form ('not made of money') to express frustration about spending.",
            "ptNote": "Muito frequentemente usado na forma negativa ('not made of money') para expressar frustração com gastos."
          }
        ]
      },
      {
        "word": "What's the matter?",
        "partOfSpeech": "expression",
        "enDefinition": "used to ask someone what is wrong, what problem they have, or why they seem upset or unwell",
        "ptDefinition": "usado para perguntar o que há de errado com alguém, qual é o problema ou por que a pessoa parece chateada ou passando mal",
        "examples": [
          {
            "enExample": "You look worried. What's the matter?",
            "ptExample": "Você parece preocupado. O que houve?"
          },
          {
            "enExample": "What's the matter with him? He seems very quiet today.",
            "ptExample": "O que há de errado com ele? Ele parece muito quieto hoje."
          }
        ],
        "synonyms": [
          "What's wrong?",
          "What's the problem?",
          "Is something wrong?"
        ],
        "antonyms": [],
        "seeAlso": [
          "What's going on?",
          "What's bothering you?",
          "What's the trouble?"
        ],
        "notes": [
          {
            "enNote": "Very common in everyday English. Often followed by 'with + person' (e.g. 'What's the matter with you?').",
            "ptNote": "Muito comum no inglês do dia a dia. Frequentemente seguido de 'with + pessoa' (ex.: 'What's the matter with you?')."
          }
        ]
      },
      {
        "word": "make up one’s mind",
        "partOfSpeech": "idiom",
        "enDefinition": "to decide something after considering different possibilities; to come to a conclusion or choice",
        "ptDefinition": "decidir algo após considerar diferentes possibilidades; chegar a uma conclusão ou escolha",
        "examples": [
          {
            "enExample": "I can’t make up my mind about which movie to watch.",
            "ptExample": "Não consigo me decidir sobre qual filme assistir."
          },
          {
            "enExample": "She finally made up her mind to study abroad next year.",
            "ptExample": "Ela finalmente se decidiu em estudar no exterior no próximo ano."
          },
          {
            "enExample": "Make up your mind before it’s too late.",
            "ptExample": "Decida-se antes que seja tarde demais."
          }
        ],
        "synonyms": ["decide", "choose", "determine", "resolve"],
        "antonyms": ["hesitate", "waver", "be undecided"],
        "seeAlso": [
          "make a decision",
          "come to a conclusion",
          "be in two minds"
        ],
        "notes": [
          {
            "enNote": "Often used when someone takes time to decide or is uncertain about their choice.",
            "ptNote": "Usado frequentemente quando alguém demora a decidir ou está incerto sobre sua escolha."
          }
        ]
      },
      {
        "word": "magazine",
        "phonetics": "/ˈmæɡ.ə.ziːn/",
        "partOfSpeech": "noun",
        "enDefinition": "a publication, usually issued regularly, containing articles, photographs, and advertisements on various topics",
        "ptDefinition": "uma publicação, geralmente periódica, que contém artigos, fotografias e anúncios sobre diversos temas",
        "examples": [
          {
            "enExample": "She bought a fashion magazine at the newsstand.",
            "ptExample": "Ela comprou uma revista de moda na banca de jornal."
          },
          {
            "enExample": "The article was published in a well-known science magazine.",
            "ptExample": "O artigo foi publicado em uma revista científica conhecida."
          }
        ],
        "synonyms": ["periodical", "journal", "publication"],
        "antonyms": ["book", "newspaper"],
        "seeAlso": ["newspaper", "journal", "catalog"],
        "notes": [
          {
            "enNote": "Magazines can be printed or digital and cover a wide range of interests, such as fashion, science, sports, and news.",
            "ptNote": "As revistas podem ser impressas ou digitais e cobrem uma ampla variedade de interesses, como moda, ciência, esportes e notícias."
          }
        ]
      },
      {
        "word": "museum",
        "phonetics": "/mjuːˈziː.əm/",
        "partOfSpeech": "noun",
        "enDefinition": "a building or institution where objects of historical, scientific, artistic, or cultural interest are stored and exhibited",
        "ptDefinition": "um edifício ou instituição onde objetos de interesse histórico, científico, artístico ou cultural são armazenados e exibidos",
        "examples": [
          {
            "enExample": "We visited the art museum to see the new exhibition.",
            "ptExample": "Visitamos o museu de arte para ver a nova exposição."
          },
          {
            "enExample": "The museum has a large collection of ancient artifacts.",
            "ptExample": "O museu tem uma grande coleção de artefatos antigos."
          }
        ],
        "synonyms": ["gallery", "exhibition hall", "collection"],
        "antonyms": ["private collection", "archive (not open to public)"],
        "notes": [
          {
            "enNote": "Museums can be dedicated to art, history, science, or other subjects and are usually open to the public.",
            "ptNote": "Museus podem ser dedicados à arte, história, ciência ou outros temas e geralmente são abertos ao público."
          }
        ]
      },
      {
        "word": "moon",
        "phonetics": "/muːn/",
        "partOfSpeech": "noun",
        "enDefinition": "the natural satellite that orbits the Earth and shines at night by reflecting the sun's light",
        "ptDefinition": "o satélite natural que orbita a Terra e brilha à noite refletindo a luz do sol",
        "examples": [
          {
            "enExample": "The full moon rose over the mountains.",
            "ptExample": "A lua cheia surgiu sobre as montanhas."
          },
          {
            "enExample": "Astronauts first walked on the moon in 1969.",
            "ptExample": "Astronautas caminharam pela primeira vez na lua em 1969."
          }
        ],
        "synonyms": "satellite, lunar body",
        "seeAlso": "planet, sun, eclipse",
        "notes": [
          {
            "enNote": "The moon has phases including new moon, crescent, quarter, gibbous, and full moon",
            "ptNote": "A lua possui fases incluindo lua nova, crescente, quarto, gibosa e cheia"
          }
        ]
      },
      {
        "word": "machine",
        "phonetics": "/məˈʃiːn/",
        "partOfSpeech": "noun",
        "enDefinition": "a device with moving parts that performs a particular task, often powered by electricity or manual effort",
        "ptDefinition": "um dispositivo com partes móveis que realiza uma tarefa específica, frequentemente movido por eletricidade ou esforço manual",
        "examples": [
          {
            "enExample": "The factory uses a machine to assemble the products quickly",
            "ptExample": "A fábrica usa uma máquina para montar os produtos rapidamente"
          },
          {
            "enExample": "She bought a coffee machine for her kitchen.",
            "ptExample": "Ela comprou uma máquina de café para a cozinha."
          }
        ],
        "synonyms": "device, apparatus, mechanism",
        "seeAlso": "engine, tool, appliance",
        "notes": [
          {
            "enNote": "Machines can range from simple mechanical tools to complex automated systems",
            "ptNote": "As máquinas podem variar de ferramentas mecânicas simples a sistemas automatizados complexos"
          }
        ]
      },
      {
        "word": "mobile phone",
        "phonetics": "/ˈmoʊ.bəl fəʊn/ (US), /ˈməʊ.baɪl fəʊn/ (UK)",
        "partOfSpeech": "noun",
        "enDefinition": "a portable electronic device used for making and receiving calls, sending messages, and accessing the internet",
        "ptDefinition": "um dispositivo eletrônico portátil usado para fazer e receber chamadas, enviar mensagens e acessar a internet",
        "examples": [
          {
            "enExample": "She always keeps her mobile phone in her bag.",
            "ptExample": "Ela sempre mantém o celular na bolsa."
          },
          {
            "enExample": "I forgot my mobile phone at home and couldn't contact anyone.",
            "ptExample": "Esqueci meu celular em casa e não consegui contatar ninguém."
          }
        ],
        "synonyms": ["cell phone", "smartphone", "cellular phone"],
        "antonyms": [],
        "seeAlso": ["telephone", "smart device"],
        "notes": [
          {
            "enNote": "Mobile phones can vary from simple devices for calls and texts to advanced smartphones with apps and internet access.",
            "ptNote": "Os celulares podem variar de dispositivos simples para chamadas e mensagens a smartphones avançados com aplicativos e acesso à internet."
          }
        ]
      },
      {
        "word": "meanwhile",
        "phonetics": "/ˈmiːn.waɪl/",
        "partOfSpeech": "adverb, noun",
        "enDefinition": "adverb: at the same time; in the time between two events; noun: the period of time between two events",
        "ptDefinition": "advérbio: ao mesmo tempo; durante o intervalo entre dois eventos; substantivo: o período de tempo entre dois eventos",
        "examples": [
          {
            "enExample": "She was preparing dinner; meanwhile, he set the table.",
            "ptExample": "Ela estava preparando o jantar; enquanto isso, ele arrumou a mesa."
          },
          {
            "enExample": "The new system is being installed. In the meanwhile, we are using the old one.",
            "ptExample": "O novo sistema está sendo instalado. Enquanto isso, estamos usando o antigo."
          }
        ],
        "synonyms": "at the same time, in the meantime",
        "antonyms": "—",
        "seeAlso": "while, meantime",
        "notes": [
          {
            "enNote": "‘Meanwhile’ is often interchangeable with ‘in the meantime’, though ‘meanwhile’ is slightly more formal in writing.",
            "ptNote": "‘Meanwhile’ muitas vezes é intercambiável com ‘in the meantime’, embora ‘meanwhile’ seja um pouco mais formal na escrita."
          }
        ],

        "videoPlayer": {
          "sticky": false,
          "src": "https://www.youtube.com/embed/SDIxknWzT9w?rel=0"
        }
      },
      {
        "word": "meadow",
        "phonetics": "/ˈmed.oʊ/ (US), /ˈmed.əʊ/ (UK)",
        "partOfSpeech": "noun",
        "enDefinition": "a field of grass, often with wild flowers, used for hay or for animals to feed on",
        "ptDefinition": "um campo de grama, muitas vezes com flores silvestres, usado para feno ou para os animais se alimentarem; campo, prado",
        "examples": [
          {
            "enExample": "We walked through the meadow filled with daisies and butterflies.",
            "ptExample": "Caminhamos pelo campo cheio de margaridas e borboletas."
          },
          {
            "enExample": "The cows were grazing peacefully in the meadow.",
            "ptExample": "As vacas estavam pastando tranquilamente no campo."
          }
        ],
        "synonyms": "field, pasture, grassland",
        "antonyms": "desert, wasteland",
        "seeAlso": "pasture, prairie",
        "notes": [
          {
            "enNote": "Common in rural landscapes and often associated with idyllic or peaceful scenery in literature.",
            "ptNote": "Comum em paisagens rurais e frequentemente associado a cenários idílicos ou pacíficos na literatura."
          }
        ]
      },
      {
        "word": "moat",
        "phonetics": "/moʊt/",
        "partOfSpeech": "noun",
        "enDefinition": "a deep, wide ditch surrounding a castle, fort, or town, typically filled with water, to provide defense against attack",
        "ptDefinition": "um fosso profundo e largo ao redor de um castelo, fortaleza ou cidade, geralmente cheio de água, para servir como defesa contra ataques",
        "examples": [
          {
            "enExample": "The medieval castle was protected by a wide moat filled with water.",
            "ptExample": "O castelo medieval era protegido por um largo fosso cheio de água."
          },
          {
            "enExample": "Enemies found it difficult to cross the moat and attack the fortress.",
            "ptExample": "Os inimigos encontraram dificuldade para atravessar o fosso e atacar a fortaleza."
          }
        ],
        "synonyms": "ditch, trench, water-filled trench",
        "antonyms": "open ground, plain",
        "seeAlso": "castle, fortress, drawbridge",
        "notes": [
          {
            "enNote": "Moats were commonly used in medieval Europe for castle defense and could be dry or filled with water.",
            "ptNote": "Os fossos eram comumente usados na Europa medieval para defesa de castelos e podiam ser secos ou cheios de água."
          }
        ]
      },
      {
        "word": "manage",
        "phonetics": "/ˈmænɪdʒ/",
        "partOfSpeech": "verb",
        "enDefinition": "to be in charge of or control something; to succeed in doing something, especially something difficult",
        "ptDefinition": "estar no comando ou controlar algo; conseguir fazer algo, especialmente algo difícil",
        "examples": [
          {
            "enExample": "She manages a team of ten people at the company.",
            "ptExample": "Ela gerencia uma equipe de dez pessoas na empresa."
          },
          {
            "enExample": "He managed to finish the project on time despite the challenges.",
            "ptExample": "Ele conseguiu terminar o projeto no prazo apesar dos desafios."
          }
        ],
        "synonyms": "administer, handle, supervise, succeed",
        "antonyms": "fail, mismanage, neglect",
        "seeAlso": "management, manager",
        "notes": [
          {
            "enNote": "‘Manage’ can mean both controlling or directing (e.g., managing a company) and succeeding in doing something difficult (e.g., managing to finish on time).",
            "ptNote": "‘Manage’ pode significar tanto controlar ou dirigir (ex.: gerenciar uma empresa) quanto conseguir fazer algo difícil (ex.: conseguir terminar a tempo)."
          }
        ]
      },
      {
        "word": "manager",
        "phonetics": "/ˈmænɪdʒər/",
        "partOfSpeech": "noun",
        "enDefinition": "a person responsible for controlling or organizing part of a company, business, or team",
        "ptDefinition": "pessoa responsável por controlar ou organizar parte de uma empresa, negócio ou equipe",
        "examples": [
          {
            "enExample": "She works as a project manager in a technology company.",
            "ptExample": "Ela trabalha como gerente de projetos em uma empresa de tecnologia."
          },
          {
            "enExample": "The team’s manager motivated everyone to reach the sales target.",
            "ptExample": "O gerente da equipe motivou todos a alcançar a meta de vendas."
          }
        ],
        "synonyms": "administrator, director, supervisor, leader",
        "antonyms": "employee, worker, subordinate",
        "seeAlso": "manage, management",
        "notes": [
          {
            "enNote": "‘Manager’ is a common business term. It can refer to different roles, such as project manager, general manager, or team manager.",
            "ptNote": "‘Manager’ é um termo comum em negócios. Pode se referir a diferentes cargos, como gerente de projetos, gerente geral ou gerente de equipe."
          }
        ]
      },
      {
        "word": "management",
        "phonetics": "/ˈmænɪdʒmənt/",
        "partOfSpeech": "noun",
        "enDefinition": "the act or process of organizing, controlling, or supervising people or resources; the group of people who run a company or organization",
        "ptDefinition": "o ato ou processo de organizar, controlar ou supervisionar pessoas ou recursos; também pode se referir ao grupo de pessoas que dirige uma empresa ou organização",
        "examples": [
          {
            "enExample": "Good time management is essential for productivity.",
            "ptExample": "Uma boa gestão do tempo é essencial para a produtividade."
          },
          {
            "enExample": "The management decided to invest in new technology.",
            "ptExample": "A administração decidiu investir em nova tecnologia."
          }
        ],
        "synonyms": "administration, supervision, organization, leadership",
        "antonyms": "mismanagement, disorganization",
        "seeAlso": "manage, manager",
        "notes": [
          {
            "enNote": "‘Management’ can refer to both the process of managing and the people in charge of an organization.",
            "ptNote": "‘Management’ pode se referir tanto ao processo de gerenciar quanto às pessoas responsáveis por uma organização."
          }
        ]
      },
      {
        "word": "miss",
        "phonetics": "/mɪs/",
        "partOfSpeech": "regular verb (past: missed / participle: missed)",
        "enDefinition": "to fail to hit, reach, or catch something; or to feel the absence of someone or something",
        "ptDefinition": "falhar em atingir, alcançar ou pegar algo; ou sentir falta de alguém ou algo",
        "examples": [
          {
            "enExample": "I missed the bus this morning.",
            "ptExample": "Perdi o ônibus esta manhã."
          },
          {
            "enExample": "She misses her family when she travels.",
            "ptExample": "Ela sente falta da família quando viaja."
          }
        ],
        "synonyms": ["fail", "lose", "long for", "yearn for"],
        "antonyms": ["hit", "reach", "find", "meet"],
        "seeAlso": ["fail", "absence", "nostalgia"],
        "notes": [
          {
            "enNote": "‘Miss’ can describe both a physical failure (like missing a target) and an emotional feeling (like missing someone).",
            "ptNote": "‘Miss’ pode se referir tanto a uma falha física (como errar um alvo) quanto a um sentimento emocional (como sentir falta de alguém)."
          }
        ]
      },

      {
        "word": "miss the point",
        "partOfSpeech": "idiom",
        "enDefinition": "to fail to understand the main or essential part of something",
        "ptDefinition": "não entender o ponto principal ou a essência de algo",
        "examples": [
          {
            "enExample": "I think you missed the point of what she was saying.",
            "ptExample": "Acho que você não entendeu o ponto principal do que ela estava dizendo."
          },
          {
            "enExample": "He kept arguing, but he totally missed the point.",
            "ptExample": "Ele continuou discutindo, mas não entendeu o verdadeiro objetivo."
          }
        ],
        "synonyms": ["misunderstand", "misinterpret", "get it wrong"],
        "antonyms": ["understand", "grasp", "get the idea"],
        "seeAlso": ["miss the mark", "take out of context"],
        "notes": [
          {
            "enNote": "Used when someone misunderstands the core meaning or intent of something.",
            "ptNote": "Usado quando alguém não compreende o significado central ou a intenção de algo."
          }
        ]
      },
      {
        "word": "make an offer",
        "phonetics": "/meɪk ən ˈɒfər/",
        "partOfSpeech": "verb phrase",
        "enDefinition": "to propose a price or terms for buying or agreeing on something; fazer uma proposta",
        "ptDefinition": "propor um preço ou condições para comprar ou concordar com algo",
        "examples": [
          {
            "enExample": "They made an offer on the house last week.",
            "ptExample": "Eles fizeram uma proposta pela casa na semana passada."
          },
          {
            "enExample": "She decided to make an offer after seeing the car.",
            "ptExample": "Ela decidiu fazer uma proposta depois de ver o carro."
          }
        ],
        "synonyms": ["propose", "bid", "submit an offer"],
        "antonyms": ["reject", "decline", "refuse"],
        "seeAlso": ["accept an offer", "counteroffer"],
        "notes": [
          {
            "enNote": "Commonly used in buying, selling, and negotiation contexts.",
            "ptNote": "Usado com frequência em contextos de compra, venda e negociação."
          }
        ]
      },
      {
        "word": "make money hand over fist",
        "partOfSpeech": "idiom",
        "enDefinition": "to earn a lot of money very quickly and easily",
        "ptDefinition": "ganhar muito dinheiro de forma rápida e fácil",
        "examples": [
          {
            "enExample": "Since launching the app, they've been making money hand over fist.",
            "ptExample": "Desde que lançaram o aplicativo, eles estão ganhando dinheiro aos montes."
          },
          {
            "enExample": "During the real estate boom, she made money hand over fist.",
            "ptExample": "Durante o boom imobiliário, ela ganhou dinheiro sem parar."
          }
        ],
        "synonyms": ["rake in money", "get rich quickly", "earn a fortune"],
        "antonyms": ["lose money", "go broke", "struggle financially"],
        "seeAlso": ["cash in", "strike it rich"],
        "notes": [
          {
            "enNote": "Often used to describe sudden or large financial success.",
            "ptNote": "Geralmente usado para descrever sucesso financeiro repentino ou em grande escala."
          }
        ]
      },
      {
        "word": "micro-manage",
        "phonetics": "/ˈmaɪ.kroʊˌmæn.ɪdʒ/",
        "partOfSpeech": "verb",
        "enDefinition": "to control every small detail of someone else's work in a way that is usually unnecessary and annoying",
        "ptDefinition": "controlar cada pequeno detalhe do trabalho de outra pessoa, geralmente de forma desnecessária e irritante",
        "examples": [
          {
            "enExample": "The boss tends to micro-manage every project, which frustrates the team.",
            "ptExample": "O chefe costuma microgerenciar todos os projetos, o que frustra a equipe."
          },
          {
            "enExample": "Good leaders delegate tasks instead of micro-managing.",
            "ptExample": "Bons líderes delegam tarefas em vez de microgerenciar."
          }
        ],
        "synonyms": ["oversee excessively", "control", "hover"],
        "antonyms": ["delegate", "trust", "empower"],
        "seeAlso": ["hands-off", "control freak"],
        "notes": [
          {
            "enNote": "Often seen as a negative leadership style.",
            "ptNote": "Frequentemente visto como um estilo de liderança negativo."
          }
        ]
      },
      {
        "word": "make the grade",
        "partOfSpeech": "idiom",
        "enDefinition": "to succeed or meet the required standard",
        "ptDefinition": "ter sucesso ou alcançar o padrão exigido",
        "examples": [
          {
            "enExample": "She tried out for the team but didn’t make the grade.",
            "ptExample": "Ela fez o teste para o time, mas não atingiu o nível exigido."
          },
          {
            "enExample": "He made the grade as a professional musician.",
            "ptExample": "Ele conseguiu alcançar o nível de músico profissional."
          }
        ],
        "synonyms": ["succeed", "measure up", "qualify"],
        "antonyms": ["fall short", "fail", "not measure up"],
        "seeAlso": ["meet the standard", "pass the test"],
        "notes": [
          {
            "enNote": "Commonly used in academic, professional, or competitive contexts.",
            "ptNote": "Comumente usado em contextos acadêmicos, profissionais ou competitivos."
          }
        ]
      },
      {
        "word": "make a splash",
        "partOfSpeech": "idiom / verb phrase",
        "enDefinition": "to get a lot of public attention or make a strong impression",
        "ptDefinition": "chamar muita atenção ou causar uma forte impressão",
        "examples": [
          {
            "enExample": "The young designer made a splash with her first fashion show.",
            "ptExample": "A jovem estilista chamou atenção com seu primeiro desfile de moda."
          },
          {
            "enExample": "The company made a splash when it launched its innovative product.",
            "ptExample": "A empresa causou impacto ao lançar seu produto inovador."
          }
        ],
        "synonyms": ["cause a stir", "make waves", "attract attention"],
        "antonyms": ["go unnoticed", "fly under the radar"],
        "seeAlso": ["make waves", "create a buzz"],
        "notes": [
          {
            "enNote": "Often used when someone or something quickly becomes popular or successful.",
            "ptNote": "Frequentemente usado quando alguém ou algo se torna popular ou bem-sucedido rapidamente."
          }
        ]
      },
      {
        "word": "my stomach (my head, my arm, etc…) is killing me",
        "partOfSpeech": "idiomatic expression",
        "enDefinition": "used to express severe pain or discomfort in a part of the body",
        "ptDefinition": "usado para expressar dor ou desconforto intenso em uma parte do corpo",
        "examples": [
          {
            "enExample": "My stomach is killing me after that spicy meal.",
            "ptExample": "Meu estômago está me matando depois daquela comida apimentada."
          },
          {
            "enExample": "My head is killing me from all the noise.",
            "ptExample": "Minha cabeça está doendo muito por causa de todo o barulho."
          }
        ],
        "synonyms": ["be in pain, hurt badly, ache"],
        "antonyms": ["feel fine, be comfortable"],
        "seeAlso": "have a headache, be in agony",
        "notes": [
          {
            "enNote": "Commonly used in informal contexts to describe pain.",
            "ptNote": "Comumente usado em contextos informais para descrever dor."
          }
        ]
      },
      {
        "word": "out of one's mind",
        "partOfSpeech": "idiom",
        "enDefinition": "acting in a way that seems irrational or crazy; being extremely worried or upset",
        "ptDefinition": "agindo de uma maneira que parece irracional ou louca; estar extremamente preocupado ou chateado",
        "examples": [
          {
            "enExample": "She must be out of her mind to drive in such terrible weather.",
            "ptExample": "Ela deve estar fora de si para dirigir em um clima tão terrível."
          },
          {
            "enExample": "He was out of his mind with worry when his son didn't come home.",
            "ptExample": "Ele estava fora de si de preocupação quando seu filho não voltou para casa."
          },
          {
            "enExample": "You're out of your mind if you think this plan will work.",
            "ptExample": "Você está fora de si se acha que esse plano vai funcionar."
          }
        ],
        "synonyms": ["crazy", "irrational", "insane"],
        "antonyms": ["rational", "sane", "calm"],
        "notes": [
          {
            "enNote": "This idiom can describe both temporary emotional states and more permanent irrational behaviors.",
            "ptNote": "Este idioma pode descrever tanto estados emocionais temporários quanto comportamentos irracionais mais permanentes."
          }
        ]
      },
      {
        "word": "of two minds",
        "partOfSpeech": "idiom",
        "enDefinition": "to be undecided or conflicted about something, having opposing opinions or feelings",
        "ptDefinition": "estar indeciso ou em conflito sobre algo, tendo opiniões ou sentimentos opostos",
        "examples": [
          {
            "enExample": "I'm of two minds about accepting the job offer; the salary is great, but it's far from home.",
            "ptExample": "Estou indeciso sobre aceitar a oferta de emprego; o salário é ótimo, mas é longe de casa."
          },
          {
            "enExample": "She's of two minds regarding the vacation plans; she wants to go, but she's concerned about the cost.",
            "ptExample": "Ela está indecisa em relação aos planos de férias; quer ir, mas está preocupada com o custo."
          }
        ],
        "synonyms": ["undecided", "torn between", "conflicted"],
        "antonyms": ["certain", "sure", "decided"]
      },
      {
        "word": "on the make",
        "partOfSpeech": "idiom",
        "enDefinition": "actively seeking personal gain, especially in a dishonest or aggressive way; trying to improve one's social or financial position",
        "ptDefinition": "buscando ativamente ganho pessoal, especialmente de forma desonesta ou agressiva; tentando melhorar sua posição social ou financeira",
        "examples": [
          {
            "enExample": "He’s always on the make, looking for ways to get ahead, no matter who gets hurt.",
            "ptExample": "Ele está sempre querendo se dar bem, procurando maneiras de se destacar, não importa quem seja prejudicado."
          },
          {
            "enExample": "Some people thought she was on the make, only interested in people who could help her career.",
            "ptExample": "Algumas pessoas achavam que ela só queria se dar bem, interessada apenas em pessoas que pudessem ajudar em sua carreira."
          }
        ],
        "synonyms": ["ambitious", "opportunistic", "self-seeking"],
        "antonyms": ["content", "selfless", "unambitious"],
        "seeAlso": ["climbing the ladder", "go-getter"],
        "notes": [
          {
            "enNote": "This idiom often has a negative connotation, implying selfish or unscrupulous motives.",
            "ptNote": "Este idiom geralmente tem uma conotação negativa, implicando motivos egoístas ou sem escrúpulos."
          }
        ]
      },
      {
        "word": "make a pass at someone",
        "partOfSpeech": "idiom",
        "enDefinition": "to try to start a romantic or sexual relationship with someone, often by flirting or expressing interest",
        "ptDefinition": "tentar iniciar um relacionamento romântico ou sexual com alguém, geralmente flertando ou demonstrando interesse",
        "examples": [
          {
            "enExample": "He got in trouble at work for making a pass at his coworker.",
            "ptExample": "Ele se meteu em problemas no trabalho por dar em cima da colega."
          },
          {
            "enExample": "She was surprised when her friend made a pass at her during the party.",
            "ptExample": "Ela ficou surpresa quando o amigo deu em cima dela durante a festa."
          }
        ],
        "synonyms": ["flirt", "hit on", "come on to"],
        "antonyms": ["ignore", "avoid", "rebuff"],
        "seeAlso": ["come on to", "hit on"],
        "notes": [
          {
            "enNote": "This idiom is informal and can sometimes imply unwanted or inappropriate advances.",
            "ptNote": "Este idiom é informal e pode, às vezes, implicar investidas indesejadas ou inadequadas."
          }
        ]
      },
      {
        "word": "make a mountain out of a molehill",
        "partOfSpeech": "idiom",
        "enDefinition": "to exaggerate a minor problem or issue and make it seem more important than it really is",
        "ptDefinition": "exagerar um problema ou questão menor e torná-lo mais importante do que realmente é",
        "examples": [
          {
            "enExample": "She made a mountain out of a molehill when she complained about the tiny scratch on her car.",
            "ptExample": "Ela fez uma tempestade em copo d'água quando reclamou do pequeno arranhão no carro."
          },
          {
            "enExample": "Don't make a mountain out of a molehill; it's just a small mistake.",
            "ptExample": "Não faça uma tempestade em copo d'água; é apenas um pequeno erro."
          }
        ],
        "synonyms": ["exaggerate", "overreact", "blow out of proportion"],
        "antonyms": ["downplay", "minimize", "understate"],
        "seeAlso": ["overreact", "make a big deal"],
        "notes": [
          {
            "enNote": "This idiom is often used to advise someone to keep things in perspective and not overreact to minor issues.",
            "ptNote": "Este idiom é frequentemente usado para aconselhar alguém a manter as coisas em perspectiva e não reagir exageradamente a questões menores."
          }
        ]
      },
      {
        "word": "move on",
        "phonetics": "/muːv ɑːn/",
        "partOfSpeech": "phrasal verb",
        "enDefinition": "to leave a place, situation, or relationship and start something new",
        "ptDefinition": "deixar um lugar, situação ou relacionamento e começar algo novo",
        "examples": [
          {
            "enExample": "After the breakup, she decided to move on and focus on her career.",
            "ptExample": "Após o término, ela decidiu seguir em frente e focar em sua carreira."
          },
          {
            "enExample": "It's time to move on from this job and find something more fulfilling.",
            "ptExample": "É hora de seguir em frente deste trabalho e encontrar algo mais gratificante."
          }
        ],
        "synonyms": ["progress", "advance", "proceed"],
        "antonyms": ["stay", "remain", "linger"],
        "seeAlso": ["move forward", "let go"],
        "notes": [
          {
            "enNote": "This phrase is often used to encourage someone to stop dwelling on the past and look towards the future.",
            "ptNote": "Esta frase é frequentemente usada para encorajar alguém a parar de se prender ao passado e olhar para o futuro."
          }
        ]
      },
      {
        "word": "messy",
        "phonetics": "/ˈmɛsi/",
        "partOfSpeech": "adjective",
        "enDefinition": "untidy or dirty",
        "ptDefinition": "bagunçado",
        "examples": [
          {
            "enExample": "Her room is always messy.",
            "ptExample": "O quarto dela está sempre bagunçado."
          },
          {
            "enExample": "The kitchen was messy after cooking dinner.",
            "ptExample": "A cozinha estava bagunçada depois de cozinhar o jantar."
          }
        ],
        "synonyms": ["untidy", "disorganized", "cluttered"],
        "antonyms": ["tidy", "organized", "neat"],
        "seeAlso": ["disorderly", "chaotic"],
        "notes": [
          {
            "enNote": "The word 'messy' is often used to describe a place or situation that is not neat or orderly.",
            "ptNote": "A palavra 'messy' é frequentemente usada para descrever um lugar ou situação que não está arrumado ou organizado."
          }
        ]
      },
      {
        "word": "mess",
        "phonetics": "/mɛs/",
        "partOfSpeech": "noun",
        "enDefinition": "a situation or state of affairs that is confused or full of difficulties",
        "ptDefinition": "uma situação ou estado de coisas que está confuso ou cheio de dificuldades",
        "examples": [
          {
            "enExample": "The room was a complete mess after the party.",
            "ptExample": "O quarto estava uma completa bagunça após a festa."
          },
          {
            "enExample": "He made a mess of the project by not following the instructions.",
            "ptExample": "Ele fez uma bagunça no projeto por não seguir as instruções."
          }
        ],
        "synonyms": ["disorder", "chaos", "clutter"],
        "antonyms": ["order", "tidiness", "organization"],
        "seeAlso": ["disarray", "jumble"],
        "notes": [
          {
            "enNote": "The word 'mess' can also be used as a verb meaning to make something untidy or disorganized.",
            "ptNote": "A palavra 'mess' também pode ser usada como um verbo que significa fazer algo ficar desarrumado ou desorganizado."
          }
        ]
      },
      {
        "word": "mad",
        "phonetics": "/mæd/",
        "partOfSpeech": "adjective",
        "enDefinition": "very angry or annoyed",
        "ptDefinition": "muito zangado ou irritado",
        "examples": [
          {
            "enExample": "She was mad at him for being late.",
            "ptExample": "Ela estava zangada com ele por estar atrasado."
          },
          {
            "enExample": "He gets mad when people don't listen to him.",
            "ptExample": "Ele fica zangado quando as pessoas não o escutam."
          }
        ],
        "synonyms": ["angry", "furious", "irate"],
        "antonyms": ["calm", "happy", "pleased"],
        "notes": [
          {
            "enNote": "In British English, 'mad' can also mean 'mentally ill' or 'insane'.",
            "ptNote": "No inglês britânico, 'mad' também pode significar 'mentalmente doente' ou 'insano'."
          }
        ]
      },
      {
        "word": "make it up to you",
        "partOfSpeech": "idiom",
        "enDefinition": "to do something to show that you are sorry for something wrong you have done and to make amends",
        "ptDefinition": "fazer algo para mostrar que você está arrependido por algo errado que fez e fazer as pazes",
        "examples": [
          {
            "enExample": "I missed your birthday, but I’ll make it up to you by taking you out for dinner.",
            "ptExample": "Eu perdi seu aniversário, mas vou compensar levando você para jantar."
          },
          {
            "enExample": "She promised to make it up to him after forgetting their anniversary.",
            "ptExample": "Ela prometeu compensá-lo depois de esquecer o aniversário deles."
          }
        ],
        "synonyms": ["apologize", "atone", "compensate"],
        "antonyms": ["ignore", "neglect", "disregard"],
        "notes": [
          {
            "enNote": "This phrase is typically used when trying to repair a relationship or situation caused by a mistake or oversight.",
            "ptNote": "Essa frase é geralmente usada quando se tenta reparar um relacionamento ou situação causada por um erro ou descuido."
          }
        ]
      },
      {
        "word": "mess around",
        "phonetics": "mɛs əˈraʊnd",
        "partOfSpeech": "phrasal verb",
        "enDefinition": "to waste time, engage in playful or unproductive behavior, or handle something carelessly",
        "ptDefinition": "perder tempo, envolver-se em comportamentos brincalhões ou improdutivos, ou lidar com algo de forma descuidada",
        "examples": [
          {
            "enExample": "Stop messing around and finish your work.",
            "ptExample": "Pare de perder tempo e termine seu trabalho."
          },
          {
            "enExample": "He was just messing around with his friends when he should have been studying.",
            "ptExample": "Ele estava apenas brincando com os amigos quando deveria estar estudando."
          }
        ],
        "synonyms": ["fool around", "play around", "waste time"],
        "antonyms": ["focus", "get serious", "concentrate"],
        "notes": [
          {
            "enNote": "This phrase is often used in informal settings and can imply a lack of seriousness or a focus on leisure rather than work.",
            "ptNote": "Esta frase é frequentemente usada em contextos informais e pode implicar a falta de seriedade ou foco no lazer em vez do trabalho."
          }
        ]
      },
      {
        "word": "mince words",
        "partOfSpeech": "idiom",
        "enDefinition": "to speak in a way that is indirect or avoids being straightforward, often to avoid offending someone",
        "ptDefinition": "falar de uma maneira indireta ou evitar ser direto, muitas vezes para não ofender alguém",
        "examples": [
          {
            "enExample": "Stop mincing your words and say what you really mean.",
            "ptExample": "Pare de ser indireto e diga o que você realmente quer dizer."
          },
          {
            "enExample": "He minced his words when discussing the sensitive topic.",
            "ptExample": "Ele foi indireto ao falar sobre o tópico sensível."
          }
        ],
        "synonyms": ["sugarcoat", "beat around the bush"],
        "antonyms": ["speak plainly", "speak directly"],
        "notes": [
          {
            "enNote": "This idiom often implies a lack of transparency or honesty in speech.",
            "ptNote": "Este idiom geralmente implica falta de transparência ou honestidade na fala."
          }
        ]
      },
      {
        "word": "my gut tells me",
        "phonetics": "/maɪ ɡʌt tɛlz mi/",
        "partOfSpeech": "idiom",
        "enDefinition": "a feeling or intuition that something is true or likely to happen, based on instinct rather than reason or evidence",
        "ptDefinition": "um sentimento ou intuição de que algo é verdade ou provável de acontecer, baseado no instinto em vez da razão ou evidências",
        "examples": [
          {
            "enExample": "My gut tells me that we should move forward with this project, even if there are risks.",
            "ptExample": "Meu instinto me diz que devemos seguir com este projeto, mesmo com os riscos."
          },
          {
            "enExample": "I can’t explain it, but my gut tells me that he’s not being honest.",
            "ptExample": "Não consigo explicar, mas meu instinto me diz que ele não está sendo honesto."
          }
        ],
        "synonyms": ["instinct says", "feeling tells me", "intuition"],
        "antonyms": [
          "reasoned judgment",
          "logical decision",
          "evidence-based conclusion"
        ],
        "notes": [
          {
            "enNote": "This idiom is used to describe a strong, instinctive feeling about something, without relying on hard facts or logic.",
            "ptNote": "Este idiom é usado para descrever um forte sentimento instintivo sobre algo, sem depender de fatos concretos ou lógica."
          }
        ]
      },
      {
        "word": "me-too products",
        "phonetics": "/miː tuː ˈprɒdʌkts/",
        "partOfSpeech": "noun",
        "enDefinition": "products that copy or closely resemble successful ones already on the market, typically made by competitors",
        "ptDefinition": "produtos que imitam ou se assemelham muito a outros já populares no mercado, geralmente feitos por concorrentes",
        "examples": [
          {
            "enExample": "The company introduced a me-too product to take on the top-selling brand in the market.",
            "ptExample": "A empresa lançou um produto semelhante para competir com a marca mais vendida do mercado."
          }
        ],
        "synonyms": ["copycat products", "knock-offs", "imitations"],
        "antonyms": ["innovative products", "original products"],
        "notes": [
          {
            "enNote": "This term often implies a lack of originality or creativity."
          },
          {
            "ptNote": "Este termo frequentemente implica falta de originalidade ou criatividade."
          }
        ]
      },
      {
        "word": "make a killing",
        "partOfSpeech": "idiom",
        "enDefinition": "to make a lot of money",
        "ptDefinition": "ganhar muito dinheiro",
        "examples": [
          {
            "enExample": "Suzanne made a killing on her Google stock and retired at 40.",
            "ptExample": "Suzanne ganhou uma fortuna com suas ações do Google e se aposentou aos 40 anos."
          }
        ]
      },
      {
        "word": "market share",
        "phonetics": "/ˈmɑrkɪt ʃɛr/",
        "partOfSpeech": "noun",
        "enDefinition": "the percentage of total sales or customers that a company or product captures within a specific market",
        "ptDefinition": "a porcentagem das vendas totais ou clientes que uma empresa ou produto conquista dentro de um mercado específico",
        "examples": [
          {
            "enExample": "The company increased its market share by launching a new product line.",
            "ptExample": "A empresa aumentou sua participação no mercado ao lançar uma nova linha de produtos."
          },
          {
            "enExample": "They are focusing on customer retention to maintain their market share in the industry.",
            "ptExample": "Eles estão focados na retenção de clientes para manter sua participação no mercado na indústria."
          }
        ],
        "synonyms": ["market portion", "market percentage", "customer base"],
        "antonyms": ["market loss", "reduced influence", "decreased share"],
        "notes": [
          {
            "enNote": "Market share is often used as a key performance indicator in business strategies."
          },
          {
            "ptNote": "A \"participação de mercado\" é frequentemente usada como um indicador chave de desempenho em estratégias de negócios."
          }
        ]
      },
      {
        "word": "menopause",
        "phonetics": "/ˈmen.ə.pɑːz/ (US)",
        "partOfSpeech": "noun",
        "enDefinition": "the time in a woman's life, typically around the age of 45–55, when menstruation permanently ceases",
        "ptDefinition": "o período na vida de uma mulher, geralmente entre 45 e 55 anos, em que a menstruação cessa permanentemente",
        "examples": [
          {
            "enExample": "Many women experience hot flashes during menopause.",
            "ptExample": "Muitas mulheres experimentam ondas de calor durante a menopausa."
          }
        ],
        "synonyms": ["climacteric", "change of life"]
      },
      {
        "word": "moderate",
        "phonetics": "/ˈmɑː.dɚ.ət/",
        "partOfSpeech": "adjective",
        "enDefinition": "average in amount, intensity, or degree; not extreme",
        "ptDefinition": "médio em quantidade, intensidade ou grau; não extremo",
        "examples": [
          {
            "enExample": "She exercises at a moderate intensity for better health.",
            "ptExample": "Ela se exercita com intensidade moderada para melhorar a saúde."
          }
        ],
        "synonyms": ["average", "medium", "mild"],
        "antonyms": ["extreme", "intense"]
      },
      {
        "word": "miscarriage",
        "phonetics": "/ˈmɪsˌker.ɪdʒ/",
        "partOfSpeech": "noun",
        "enDefinition": "an early, unintentional end to a pregnancy when the foetus is born too early and dies because it has not developed enough",
        "ptDefinition": "aborto espontâneo",
        "examples": [
          {
            "enExample": "The amniocentesis test carries a significant risk of miscarriage.",
            "ptExample": "O teste de amniocentese carrega um risco significativo de aborto espontâneo."
          }
        ]
      },
      {
        "word": "moderate",
        "phonetics": "/ˈmɑː.dɚ.reɪt/",
        "partOfSpeech": "verb",
        "enDefinition": "to make or become less extreme, intense, or severe",
        "ptDefinition": "fazer ou tornar algo menos extremo, intenso ou severo",
        "examples": [
          {
            "enExample": "The teacher moderated the discussion to keep it on topic.",
            "ptExample": "O professor moderou a discussão para mantê-la no tema."
          }
        ],
        "synonyms": ["temper", "control", "adjust"],
        "antonyms": ["intensify", "escalate"]
      },
      {
        "word": "mum's the word",
        "partOfSpeech": "idiom",
        "enDefinition": "let's keep quiet about this; I agree not to tell anyone about this",
        "ptDefinition": "vamos manter isso em silêncio; concordo em não contar a ninguém sobre isso",
        "examples": [
          {
            "enExample": "Please don't tell anybody about our new project. Remember: mum's the word!",
            "ptExample": "Por favor, não conte a ninguém sobre o nosso novo projeto. Lembre-se: boca fechada!"
          }
        ]
      }
    ]
  }
]
